[
  {
    "id": "Academic Outreach",
    "title": "Academic Outreach",
    "description": "Advisor: Stacey Rapp. The goal of this club is to expose interested students to the world of teaching by participating in and encouraging activities that promote learning. In collaboration with South Middle, high school students are allowed to tutor middle school students in all subject areas. Students may also assist at elementary student centers and may have the opportunity to assist in classrooms. The club holds fundraisers and sponsors Teacher Appreciation Day.",
    "googleclasscode": "et5mx7um",
    "meetinginfo": "Meet on a weekly basis with your student for one-on-one instruction."
  },
  {
    "id": "Adolescent Advocates",
    "title": "Adolescent Advocates",
    "description": "Advisor: Joan Greenberg. Adolescent Advocates, working in conjunction with HMTC, are students trained to respond to words and acts of hate, bias, and intolerance. The mission of the Adolescent Advocates is to promote and implement upstander (ally) behavior within GNSHS and the community, creating a safer school environment for all students by developing awareness of microaggressions and striving to be anti-racist.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "African American Culture Club",
    "title": "African American Culture Club",
    "description": "Advisor: Heather Peretz. Fosters an understanding and appreciation of African-American culture. Highlight activities include participation in Cultural Heritage Night, the MLK Assembly, and various events celebrating Black History Month. ALL are welcome to join!",
    "googleclasscode": "tjwoni7",
    "meetinginfo": "Google Classroom Code for meeting info: tjwoni7"
  },
  {
    "id": "Anime",
    "title": "Anime",
    "description": "Advisor: Joseph Ko. For students who enjoy the anime genre. Club members decide on the programs to watch during meetings. Members also participate in art contests and other anime-related activities.",
    "googleclasscode": "jpz7yulv",
    "meetinginfo": "Meetings every Monday in Room 414"
  },
  {
    "id": "Architecture Club",
    "title": "Architecture Club",
    "description": "Advisor: Michael Passuello. The Architecture Club is for students interested in designing and building group-oriented construction projects as well as individual projects. School and community-based projects will be the focus. Drafting, rendering, and CAD with Chief Architect will be performed.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "AREA-C",
    "title": "AREA-C",
    "description": "Advisors: Abby Jo Brighton/Patrick Graham. This club raises awareness of environmental issues and participates in efforts that assist local animal shelters and community recycling programs.",
    "googleclasscode": "a4seogny",
    "meetinginfo": "Monday, biweekly, Room 451"
  },
  {
    "id": "Art Club",
    "title": "Art Club",
    "description": "Advisor: Megan Cashman. Art Club is a community where meaningful connections are formed, and art is explored as a powerful means of fostering compassion and creativity.",
    "googleclasscode": "pmr7eee",
    "meetinginfo": "Tuesdays 2:45 pm room 206"
  },
  {
    "id": "Asian Culture Society",
    "title": "Asian Culture Society",
    "description": "Advisor: Maggie Hao Wu. Open to all students interested in learning, teaching, and sharing facets of Asian culture. Activities are varied: picnics, participation in South High's annual Cultural Heritage Night, fundraisers, and promoting greater intercultural exchanges and community-building with the entire student population.",
    "googleclasscode": "Unknown",
    "meetinginfo": "First meeting 9/15 Monday right after school in the courtyard"
  },
  {
    "id": "Astronomy Club",
    "title": "Astronomy Club",
    "description": "Advisor: Holly Cipriano. For students interested in delving into astronomy and environmental/earth sciences, causes of natural disasters, and anything to do with the Earth and beyond! Come all to check out the school telescope and to solve real-world problems dealing with the environment.",
    "googleclasscode": "hz47avjn",
    "meetinginfo": "First Meeting: Thurs. Sept. 25 2:40pm Room 609"
  },
  {
    "id": "ASL American Sign Language",
    "title": "ASL American Sign Language",
    "description": "Advisor: Chris Erickson. No previous ASL skills required. Stop by for snacks, fun, & the opportunity to participate in community service events!",
    "googleclasscode": "uidkwl4t",
    "meetinginfo": "Mondays in 443"
  },
  {
    "id": "Automotive Technology Club",
    "title": "Automotive Technology Club",
    "description": "Advisor: John Motchkavitz. Focuses on the hands-on application of the automotive field, where students will get an opportunity outside of the \"know your car\" curriculum to learn more about vehicles and modern transportation systems. Students will also get to explore other aspects of the technology department, such as; material processing, electronics, and robotics. The car club holds the Great Neck South Car Show at the end of the school year.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "AWARE- Pen-Pal",
    "title": "AWARE- Pen-Pal",
    "description": "Advisor: Allison Gottfried. For students interested in becoming a pen pal to an elementary student. AWARE is a club that works with students who are a part of the integrated population, along with students with disabilities. The club sets up a visit to the cooperating elementary school so that students are able to meet their pen pals. Elementary students may also visit South High to meet with their pen pal and experience a taste of our arts, technology, music, and physical education offerings.",
    "googleclasscode": "cls5mxu",
    "meetinginfo": "Meets in Guidance and dates will be posted on Google Classroom cls5mxu"
  },
  {
    "id": "Book Cafe Club",
    "title": "Book Cafe Club",
    "description": "Advisor: Margarette Dunne. Spread book love throughout the building by hosting book tastings, book drives, and drop-in silent book reading.",
    "googleclasscode": "wx7wjux",
    "meetinginfo": "First Book Talk Thurs 9/18 in 449. Book Talks 3rd Thursday monthly in 449. Readers' Lounge every other Tuesday in 449 starting 9/30."
  },
  {
    "id": "Boys Athletic Association",
    "title": "Boys Athletic Association",
    "description": "Advisor: James Morrow. Supports all Boys’ Athletic Teams through events and fundraisers. Encourages school pride. Assists Boys’ athletic teams through fundraising and running events and clinics.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Buddy Club",
    "title": "Buddy Club",
    "description": "Advisor: Dane Nordland. Mentoring program for upperclassmen to mentor and educate underclassmen on knowing their IEPs, Accommodations, and the High School/College process. Adopt incoming freshmen who lack the social skills and need a pal/buddy/friend.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Ceramics Club",
    "title": "Ceramics Club",
    "description": "Advisor: Colleen Campbell. Members work on hand-built and wheel-thrown projects in clay. All levels are welcome.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Chess Team",
    "title": "Chess Team",
    "description": "Advisor: Jennifer Koo. Think you are a chess genius? Join the chess club/team to play against other chess players in our school and in Nassau County. Don’t know how to play yet? We’ll teach you!",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Christian Seekers Club",
    "title": "Christian Seekers Club",
    "description": "Advisor: David Manuel. Promotes the awareness and understanding of Christianity.",
    "googleclasscode": "y6lfrx2",
    "meetinginfo": "Weekly Meetings on Tuesdays @ 3 p.m. in Room 404"
  },
  {
    "id": "Class of 2026",
    "title": "Class of 2026",
    "description": "Advisor: David Moyal (Senior), but for Class Planning Committees. These committees coordinate members of the respective classes for events like Rebel Olympics, junior and senior events, fundraising, the prom, and other special events.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Class of 2027",
    "title": "Class of 2027",
    "description": "Advisor: Jim Morrow (Junior), but for Class Planning Committees. These committees coordinate members of the respective classes for events like Rebel Olympics, junior and senior events, fundraising, the prom, and other special events.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Class of 2028",
    "title": "Class of 2028",
    "description": "Advisor: Andy Tuomey (Sophomore), but for Class Planning Committees. These committees coordinate members of the respective classes for events like Rebel Olympics, junior and senior events, fundraising, the prom, and other special events.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Class of 2029",
    "title": "Class of 2029",
    "description": "Advisor: TBA (Freshman), but for Class Planning Committees. These committees coordinate members of the respective classes for events like Rebel Olympics, junior and senior events, fundraising, the prom, and other special events.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Community Action Committee",
    "title": "Community Action Committee",
    "description": "Advisor: Jo-AnnEyre Cruz. We are a community service organization that is always looking for new ideas. We aim to help out many different organizations around our community. Highlights include a Thanksgiving dinner for senior citizens, cooking and baking for the Ronald McDonald house, making goodie bags for the Cohen’s Children’s Hospital, and several fundraising projects.",
    "googleclasscode": "6ypsgyt",
    "meetinginfo": "Wednesdays after school in the Guidance office (above math hallway)"
  },
  {
    "id": "Computer Programming Club",
    "title": "Computer Programming Club",
    "description": "Advisor: Melissa Strugatz. Learn coding, collaborate on projects, and explore technology through hands-on activities, competitions, and peer mentoring.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Contemporary Music Club",
    "title": "Contemporary Music Club",
    "description": "Advisor: Anthony Virgilio. This club acts as a community for young musicians and performs modern music for audiences throughout the school year. Our most notable event is the annual Battle of the Bands concert. All Vocalists and Instrumentalists who wish to perform Pop, Rock, Dance, Hip Hop, or Funk music in a live band should join. See Mr. Virgilio in room 309A for more details.",
    "googleclasscode": "5r4oqrs6",
    "meetinginfo": "Wednesdays from 2:45pm-3:50pm in room 309"
  },
  {
    "id": "Debate Team",
    "title": "Debate Team",
    "description": "Advisors: Heather Peretz/Eric Saur. Students meet weekly to prepare for competition in Long Island Forensic League debate tournaments. Students research debate topics, compose position papers, and engage in mock debates, all while learning basic techniques and principles of rhetoric and argumentation. Students’ ultimate goal is qualification for, and participation in, the NYS Forensic League Tournament held in early Spring.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "DECA Club/School Store",
    "title": "DECA Club/School Store",
    "description": "Advisors: Sheryl Demetres/Rick Vine. A business and marketing club that deals with all aspects of marketing investments and finance. Annual highlights include participating in the National DECA Convention.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "E-Sports Club",
    "title": "E-Sports Club",
    "description": "Advisor: Jennifer Koo. Esports is a club made by video gamers for video gamers, welcoming casuals and pros alike! Join our weekly meetings to plan for game-related events around the school, strategize for competitive tournaments, and play games on the Nintendo Switch. Outside of our meetings, we participate in online gaming competitions held by PlayVS for regional and national recognition as well as potential scholarships.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "ENL Club",
    "title": "ENL Club",
    "description": "Advisors: Lauren Fiore/Lillian Hsiao. This club is open to all current and former ENL students. Club members will focus on two major ENL events, such as an international activity and a social gathering. Members plan, organize, and run the events. In addition, members provide translation services to new students, parents, and the community.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Envirothon Club",
    "title": "Envirothon Club",
    "description": "Advisor: Andrew Tuomey. Focuses on preparing for the Envirothon Competition. This environmental competition delves not only into the sciences of our soils, water, trees, animals, and ecosystems, but also looks into how we can protect, preserve, and restore our environment and its resources. Having a sustainable environment is the future of this earth, and educating people on how to protect our globe is the first step to a cleaner, safer, and less toxic future.",
    "googleclasscode": "Unknown",
    "meetinginfo": "First meeting: 11/1 BD"
  },
  {
    "id": "Exit 33 (Literary Magazine)",
    "title": "Exit 33 (Literary Magazine)",
    "description": "Advisors: Art: Scott Honig, Literature: Magarette Dunne. The school’s literary magazine is run entirely by students. Exit 33 needs writers, artists, editors, and other students interested in producing this year’s magazine.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Fashion Club",
    "title": "Fashion Club",
    "description": "Advisors: Scott Feldman/Catherine Leung. For students interested in dance, fashion, and raising money for charity/the senior class. Students will produce and perform the school’s annual fashion show.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Female Empowerment",
    "title": "Female Empowerment",
    "description": "Advisor: Erica MacDonald. GNSFES works to advocate and spread awareness for all components of women’s rights and female empowerment. Students meet to discuss feminism in the media, current events, and organize initiatives promoting the voice of women, and more. Open to students of all genders!",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Fiber Arts",
    "title": "Fiber Arts",
    "description": "Advisor: Tamara Fernandez. Learn to crochet-crochet for charity.",
    "googleclasscode": "6tyslphq",
    "meetinginfo": "Thursdays @ 2:45 in the Makerspace"
  },
  {
    "id": "Gaming Club",
    "title": "Gaming Club",
    "description": "Advisor: Dana Macrigiane. We are a welcoming club that plays a variety of games, ranging from mahjong to DnD! Join us for times of joy and prosperity!",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Girls Varsity Association",
    "title": "Girls Varsity Association",
    "description": "Advisor: Tara Schiereck. A service organization that helps promote and honor all of our female athletes. Annual charitable contributions and awards banquet proudly exemplify how this club promotes individual and school pride at GNSHS.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Global Village",
    "title": "Global Village",
    "description": "Advisor: Michelle Sorise. Have you recently been on a service trip and want to bring an initiative back to the school? Is there a local or global community you are driven to help? The goal of this club is to build awareness about and raise funds for global communities in need. We run many fundraisers, including running the food concession at Cultural Heritage Night. In the past, we have made donations to support orphanages and schools in Tanzania and Nicaragua, the Heifer International Project, and Natural Disaster Relief Funds.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Meetings: First Thursday each Month Room 402"
  },
  {
    "id": "Gourmet’s Club",
    "title": "Gourmet’s Club",
    "description": "Advisor: Catherine Leung. Come feast at the Gourmet's Club! All foodies unite! Chef demonstrations from local restaurants, contests, food, learning new culinary skills, discussing great meals, and cooking ideas! All food interests are welcome, if you eat, like food, like to make food, like to watch food being prepared or just like to talk about a great meal or dessert, come on by!! Meetings twice per month.",
    "googleclasscode": "vtxwh3cj",
    "meetinginfo": "First meeting on September 25! Room 212"
  },
  {
    "id": "Model Congress",
    "title": "Model Congress",
    "description": "Advisor: Tim Madden (Government Club). This club is for students interested in learning about all aspects of politics. The annual highlights include participation in Model Congresses and helping organize guest speakers.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "GSA",
    "title": "GSA",
    "description": "Advisor: Joan Greenberg. A club that brings together all members of the South community to broaden awareness of issues for gay and transgender youth. The alliance fosters understanding and seeks to create a “safe space” for all members of the South community to address any issues and heighten school acceptance and decrease homophobia.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Hebrew Culture/Jewish Student Union",
    "title": "Hebrew Culture/Jewish Student Union",
    "description": "Advisor: Ellen Shabi. Students learn and discuss Jewish culture and traditions.",
    "googleclasscode": "hwhcyfa",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Hispanic Culture Club",
    "title": "Hispanic Culture Club",
    "description": "Advisor: Ana Tavares. This club represents the Hispanic student body of South High. The club celebrates its members' cultural diversity through performances at school-wide events. Aside from educating its members and the school on Hispanic culture in the United States, the club offers meeting opportunities to foster learning success and leadership development. There are also trips to college fairs and campuses in conjunction with the Guidance Dept.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "History Club",
    "title": "History Club",
    "description": "Advisor: Fran Tria. Serves to improve awareness of history through competition to a large student body and expand the number of participants/representatives at the yearly events. The Club is open to all students interested in history, research, and competition using public presentation/speaking skills.",
    "googleclasscode": "rf306dlw",
    "meetinginfo": "First Meeting: September 18th, 2:45PM. Meetings: Thursdays, 2:45PM, Room 431"
  },
  {
    "id": "International Club/Cultural Heritage Night",
    "title": "International Club/Cultural Heritage Night",
    "description": "Advisor: Meagan Hyman. Responsible for all aspects of running Cultural Heritage Night, which is an opportunity for South High's various cultural groups to share music, dance, and other aspects of their cultures. Committee members will learn valuable organizational and leadership skills while participating in this exciting event.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Interact",
    "title": "Interact",
    "description": "Advisor: John Motchkavitz. The Interact Club is a student-led organization dedicated to community service and leadership development. Working in partnership with the Gold Coast/Lake Success Rotary Club, the students are inspired to make a positive impact both locally and globally. Through volunteering, fundraising, and service projects, members learn the value of compassion, teamwork, and civic responsibility. The Rotary Club provides mentorship and support, helping Interact members turn their ideas into meaningful action. Together, they strive to build a stronger, more connected community through service.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Key Club",
    "title": "Key Club",
    "description": "Advisor: Holly Barbarossa. This community service club comes up with ways to serve our school and community. Its projects include, but are not limited to, fundraising for organizations that support a good cause, food drives, serving meals at the Ronald McDonald house, and organizing the fall and spring blood drives.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Math Team",
    "title": "Math Team",
    "description": "Advisor: Thomas Weisswange. This club is for students who enjoy the challenge of interesting math problems. Members participate in 24 competitions a year – some are head-to-head at other schools, many are here at GNSHS, and the level of difficulty varies from moderate to difficult. Top scorers can qualify for a state tournament and a national tournament. GNSHS has a very strong reputation in this field.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Midnight Run",
    "title": "Midnight Run",
    "description": "Advisor: Michelle Sorise. Members of this club collect and organize clothing and other goods for the homeless in NYC, families of soldiers at Fort Drum, and other local communities in need. Students will have the opportunity to go into the city on one weekend day a month to deliver supplies and food to those in need.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Mock Trial",
    "title": "Mock Trial",
    "description": "Advisor: Tim Madden. Students learn the roles of attorneys and witnesses as well as the legal process of civil and criminal trials. The culminating event every spring is participation in the New York State Mock Trial tournaments when students from GNS compete in trials against opposing teams from other local high schools at the Nassau County Supreme Court.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "National Science Bowl",
    "title": "National Science Bowl",
    "description": "Advisor: James Truglio. Participate in the annual Regional Science Bowl competition.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Neuroscience Club",
    "title": "Neuroscience Club",
    "description": "Detailed description not available on the main site (subpage exists but content could not be fully extracted). Only club name listed.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Peer Drug Educators",
    "title": "Peer Drug Educators",
    "description": "Advisor: Joan Greenberg. Members pledge to be drug and alcohol free. The club emphasizes sharing information with other students about making healthy decisions.",
    "googleclasscode": "iojc37y",
    "meetinginfo": "Every Other Monday (can vary) | First Meeting on 9/15 | Room: Social Work Office in Guidance"
  },
  {
    "id": "Philosophy Club",
    "title": "Philosophy Club",
    "description": "Advisor: Brian Fadde. What is happiness? How can one be a good person? What is the meaning of life? And, of course, which lever should you pull on that killer trolley? Ranging from the philosophers of the ancient world to the authors and intellectuals theorizing and shaping today's modern, digital age, we explore and discuss philosophy and ethics, philosophers and their theories, and even some real-world applications of philosophical theories.",
    "googleclasscode": "7hotjdb",
    "meetinginfo": "Every Other Wednesday | First Meeting on 9/17 Room 448"
  },
  {
    "id": "Photography and Digital Art Club",
    "title": "Photography and Digital Art Club",
    "description": "Advisor: Safia Fatimi. This club offers an opportunity for students to experiment with photography and document activities around the school. Students are encouraged to pursue individual projects and/or participate in a group photo mural. See the photo mural outside Dean’s office and the west gym for the previous year’s mural project.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Physics Club",
    "title": "Physics Club",
    "description": "Advisor: James Truglio. This club was created to help prepare students for advanced problem-solving, as well as to introduce students to basic principles of engineering. Members are encouraged to compete in the Physics Olympiad, Physics Bowl, and Physics Brawl, for which they are provided with materials and resources to assist in preparation. Additionally, there is a make-it component to the club in which members vote on what they would like to build. This previously culminated in the construction of functioning Bluetooth speakers.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Psychology",
    "title": "Psychology",
    "description": "Advisor: David Moyal. We discuss psychological phenomena from disorders to how psychology works in society, personally, and professionally. Our goal is to educate, challenge stigma, and raise mental health awareness. The Psychology Club offers students a chance to explore the field of psychology outside the classroom in a fun, social, and educational way. Topics we previously explored include phobias, criminology, positive psychology, romanticization of mental illnesses, empathy, and social psychology. We value our club members’ interests and opinions, as some of these topics were suggested by them! Explore Psychology with Us!",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Pre-Med Club",
    "title": "Pre-Med Club",
    "description": "Advisor: Holly Cipriano. For students interested in medicine who would like to learn more about the healthcare field. Compete in the HOSA competition on the state and national level. Get a head start on internships and volunteering experience.",
    "googleclasscode": "iawfuf5",
    "meetinginfo": "First Meeting: Thurs. Sept 18 2:40pm room 609"
  },
  {
    "id": "Quiz Bowl Academic Team",
    "title": "Quiz Bowl Academic Team",
    "description": "Advisor: Jacob Friedman. Students compete in numerous general academic and history quiz bowl competitions and tournaments.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Rebel TV",
    "title": "Rebel TV",
    "description": "Advisor: Michael Passuello. South High’s TV productions.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Rebels Connect",
    "title": "Rebels Connect",
    "description": "Advisor: Jessica Skemer. Rebels Connect is a place where you can establish and maintain connections amongst all peers and across all grades. The club focuses on raising awareness and providing opportunities to learn about Autism through community walks, fundraising, and guest speakers. Members also have the chance to coordinate with local organizations.",
    "googleclasscode": "vfldct3z",
    "meetinginfo": "First meet: 9/17 @3:00. We meet every other Wednesday in room 503B next to the Library."
  },
  {
    "id": "Robotics",
    "title": "Robotics",
    "description": "Advisors: Matthew Corrigan/John Motchkavitz. Students work throughout the year on building advanced robotic machines using CAD and other technology procedures. The team also competes annually in the US First Robotics Competition. Many scholarship opportunities are available to team members at universities throughout the U.S.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "SADD - (Students Against Destructive Decisions)",
    "title": "SADD - (Students Against Destructive Decisions)",
    "description": "Advisor: Allison Gottfried. For students interested in spreading knowledge about the dangers of making destructive decisions. This club works on increasing awareness of the consequences of making poor decisions. Rooted in the effort to stop drunk driving, the club also tackles many issues, such as bullying, texting, violence, etc. Members organize guest speakers, demonstrations, and participate in activities that spread their positive message. Members also use signs, ribbons, pencils, and handouts to achieve their goals.",
    "googleclasscode": "ygkyvi6",
    "meetinginfo": "Meets in Guidance as posted on the Google Classroom ygkyvi6"
  },
  {
    "id": "Science Olympiad",
    "title": "Science Olympiad",
    "description": "Advisors: Nicole Spinelli/James Truglio. Participate in the Science Olympiad competition.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Set Design",
    "title": "Set Design",
    "description": "Advisor: John Motchkavitz. Members work on the scenery and sets for the school musical and plays. Activities include painting, carpentry, stage lighting, and construction.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Southerner (School Newspaper)",
    "title": "Southerner (School Newspaper)",
    "description": "Advisor: Jennifer Hastings. The school’s student-run newspaper needs writers, editors, photographers, business managers, and layout designers.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "South Asian Cultural Club",
    "title": "South Asian Cultural Club",
    "description": "Advisor: Safia Fatimi. To celebrate and bring awareness of South Asian Students at GNS.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "South High Sisterhood",
    "title": "South High Sisterhood",
    "description": "Advisor: Courtney Knacke. South High Sisterhood is a peer mentorship club that pairs upperclass students with underclass students to help support their transition into high school—academically, socially, and emotionally. Through guidance, encouragement, and community, members foster connections that make South High feel like home. While the club’s name nods to the idea of “big sisters” and “little sisters,” all students are welcome to join, regardless of gender identity. Our goal is to create lasting bonds, build confidence, and ensure every student feels supported throughout their high school journey.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "SPEC (Students Putting an End to Cancer)",
    "title": "SPEC (Students Putting an End to Cancer)",
    "description": "Advisor: Carly Bank. Promotes awareness of cancer and related issues.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Student Government",
    "title": "Student Government",
    "description": "Advisors: Jane Callaghan/Bridget Forie. Students must be elected in the annual elections. Representatives play an integral part in planning many school activities. Members interact with faculty and administration to accomplish numerous goals.",
    "googleclasscode": "eowgn76y",
    "meetinginfo": "Join our google classroom for meeting time and location"
  },
  {
    "id": "Support Our Troops",
    "title": "Support Our Troops",
    "description": "Advisor: Michael Passuello. Participate in charitable contributions and drives in honoring veteran members of our armed forces.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Table Tennis",
    "title": "Table Tennis",
    "description": "Advisor: James Truglio. This club allows students to pursue table tennis on both a recreational and competitive level and holds periodic charity tournaments to support local causes.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "Theatre South",
    "title": "Theatre South",
    "description": "Advisor: Ilana Meredith Schikler. For students interested in theatre on stage and off. Annual highlights include a fall musical, winter play, spring one-acts, improv troupe, coffee houses, social events, and trips into the city. No experience necessary - just an interest in theatre!",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  },
  {
    "id": "VISTA (Yearbook)",
    "title": "VISTA (Yearbook)",
    "description": "Advisors: Karen Cuchel/Jennifer Scheinberg. This club produces the school’s annual yearbook. It relies on creative team players who want to develop the pages and sections of the book. New ideas are vital, and the reward of the finished product is special. Underclassmen are welcome.",
    "googleclasscode": "Unknown",
    "meetinginfo": "Unknown"
  }
]