[
  {
    "id": "Studio Art 1",
    "dept": "Art",
    "code": "721",
    "title": "Studio Art 1",
    "description": "This course begins the comprehensive art sequence. Basic principles of composition, color, and two and three-dimensional design will be explored. Students will have the opportunity to work in a broad variety of media. Students will begin to create their portfolio in this class. Discussion of art both past and present will be included. This course can be used towards a State Regents Sequence.",
    "credits": 1.0,
    "prerequisite": "No prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 1
  },
  {
    "id": "Studio Art 2",
    "dept": "Art",
    "code": "722",
    "title": "Studio Art 2",
    "description": "This course is designed for students who have completed a full year of Studio Art I. An advanced application and utilization of the concepts covered in Studio Art I will be stressed. The emphasis of the course will be individual growth and problem solving. This course can be used towards a State Regents Sequence.",
    "credits": 1.0,
    "prerequisite": "Studio Art I or Juniors and Seniors",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 1
  },
  {
    "id": "Advanced Portfolio Development",
    "dept": "Art",
    "code": "724",
    "title": "Advanced Portfolio Development",
    "description": "This course is for seniors or juniors who would like to add a class in addition to Advanced Art and who are ready to work on a series of more demanding studio art assignments. Students will work on developing their creativity as well as their personal artistic style. The class will give students the opportunity to focus on techniques they enjoyed in their previous studio classes, such as; printmaking, painting or collage, over an extended period of time.",
    "credits": 1.0,
    "prerequisite": "Advanced Art",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Advanced",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 1
  },
  {
    "id": "Illustrating Graphic Novels",
    "dept": "Art",
    "code": "725",
    "title": "Illustrating Graphic Novels",
    "description": "Students will combine text and image to create stories. Working independently and collaboratively they will develop their own characters, scenes and longer stories. This course will help to build on the familiarity students already have with the genre to more systematically explore the power of communicating with text and image. Along with the Graphic Novel literature class will help with approaching art as an interdisciplinary study.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 1
  },
  {
    "id": "College Advanced Art",
    "dept": "Art",
    "code": "726",
    "title": "College Advanced Art",
    "description": "This course is concerned with advanced drawing and painting. Creating a well-balanced group of images will be the goal of this class. This course is designed to help students prepare a portfolio of art that might be used for college entrance. Students who have completed Studio Art 1 & 2 can take College Advanced Art. This course can be used towards a State Regents Sequence. South High School's partnership with L.I.U. Post allows students to register for 3 college credits for completing this class.",
    "credits": 1.0,
    "prerequisite": "Studio Art 1 & 2",
    "grade_levels": [],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Can earn 3 college credits (L.I.U. Post). Student Requests Accepted No",
    "source_page": 1
  },
  {
    "id": "Graphic Design 1",
    "dept": "Art",
    "code": "728",
    "title": "Graphic Design 1",
    "description": "Graphic Design 1 teaches ways to design for communication. Students will learn the ways that commercial artists problem solve with words and pictures. Projects will include advertising design, logos and public interest posters. Adobe Photoshop & Illustrator will be taught in this course.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Can count for Art or Computer credit. Student Requests Accepted Yes",
    "source_page": 1
  },
  {
    "id": "GRAPHIC DESIGN 2",
    "dept": "Art",
    "code": "0729",
    "title": "GRAPHIC DESIGN 2",
    "description": "This course is a second level graphic design course designed to be taken after Graphic Design 1. Students will create projects that explore visual communication with words and images. Client based projects and illustration will be explored as well as new areas of graphic design. Students will experience brainstorming and sketching concepts for presentations to the class and/or clients. This course will further prepare students interested in creating and AP 2D Design/Photo. Students should have a prior working knowledge of imaging software such as Adobe Photoshop and Adobe Illustrator.",
    "credits": 0.5,
    "prerequisite": "Graphic Design 1",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 2
  },
  {
    "id": "AP Studio in Art for Grade 12",
    "dept": "Art",
    "code": "730",
    "title": "AP Studio in Art for Grade 12",
    "description": "This course is being offered to advanced art students who have completed the necessary prerequisite and have been recommended by the department. Successful completion of the course requires independent work outside of class as well as arranged time in school to work with the art advisor/instructor. All students must submit a portfolio in May of senior year to be evaluated by the College Board. *Students enrolled in the Studio Art AP course are required to take the Advanced Placement exam in May.",
    "credits": 1.0,
    "prerequisite": "Studio I & II, Advanced Art, Portfolio review and permission",
    "grade_levels": [
      "12"
    ],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Seniors only. Student Requests Accepted No",
    "source_page": 2
  },
  {
    "id": "Art History AP",
    "dept": "Art",
    "code": "732",
    "title": "Art History AP",
    "description": "This class is a global survey of painting, sculpture and architecture from the ancient world to the present. Students will begin to understand the meaning of works of art and architecture. They will develop their skills of observation, criticism and writing. Students will learn to connect the visual arts and architecture to history and culture. The course culminates in an AP exam. *Students enrolled in the Art History AP course are required to take the Advanced Placement exam in May.",
    "credits": 1.0,
    "prerequisite": "10th, 11th & 12th grade students ONLY",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 2
  },
  {
    "id": "Ceramics",
    "dept": "Art",
    "code": "741",
    "title": "Ceramics",
    "description": "An introductory course covering a wide range of ceramic pottery and/or ceramic sculpture. Individual development is encouraged and a wide variety of methods will be explored including glazing and other finishing techniques.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 2
  },
  {
    "id": "Advanced Ceramics",
    "dept": "Art",
    "code": "743",
    "title": "Advanced Ceramics",
    "description": "This course is designed for the student who has completed two semesters of basic ceramics and would like to explore more advanced projects in pottery and sculpture. Emphasis will be placed on self-exploration and creative expression. Students will have the opportunity to work on the potter’s wheel.",
    "credits": 0.5,
    "prerequisite": "1 full year Ceramics",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Advanced",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 2
  },
  {
    "id": "Photography 1",
    "dept": "Art",
    "code": "765",
    "title": "Photography 1",
    "description": "This course is an introduction to photography through digital imaging and editing. Students will explore photo manipulation using digital cameras and imaging software, such as Photoshop. Students will create photomontages and digital graphics using a variety of resources and learn photo retouching, photo restoring and black and white photo color tinting techniques. General Mac platform topics like printing, scanning and file sharing, as well as basic elements of color theory, design and composition will also be covered.",
    "credits": 0.5,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Can count for Art or Computer credit. Student Requests Accepted Yes",
    "source_page": 3
  },
  {
    "id": "Photography 2",
    "dept": "Art",
    "code": "766",
    "title": "Photography 2",
    "description": "This course is a continuation of Photography 1 and creates a sequence in photography. As students become more confident in the medium, the class will provide students a place to work on more open-ended projects such as landscape, portraiture and still life. This course requires weekly shooting assignments that are completed outside of class.",
    "credits": 0.5,
    "prerequisite": "Photography 1",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Can count for Art or Computer credit. Student Requests Accepted Yes",
    "source_page": 3
  },
  {
    "id": "AP Photo/AP 2D Design",
    "dept": "Art",
    "code": "768",
    "title": "AP Photo/AP 2D Design",
    "description": "This is a full year course in photography or graphic design for students interested in completing a portfolio to be submitted to the College Board. Students will work independently, under the guidance of the instructor, to develop an independent theme for their work. The first half of the course will include assigned projects on a variety of themes and subjects to address the principles of design and is intended to help students as they plan their independent projects. Students who have taken the studio sequence can take the AP in Photo/2D design instead of AP Studio. In some cases, students have completed portfolios in photography and studio art. Digital camera strongly recommended. *Students enrolled in the AP Photo/AP 2D Design course are required to take the Advanced Placement exam in May.",
    "credits": 1.0,
    "prerequisite": "Photography 1 and 2, Graphic Design 1 and 2 and/or Personal Filmmaking",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 3
  },
  {
    "id": "Personal Filmmaking",
    "dept": "Art",
    "code": "0770",
    "title": "Personal Filmmaking",
    "description": "This course explores how the moving image and sound can be combined to create stories, personal narratives and abstract visual effects. This course enhances a student's experience in photography by providing an opportunity to create artwork with moving images. Students will use cameras and iPads as capturing devices and editing software such as iMovie and various film editing apps to create dynamic narratives. Students will watch short films covering a variety of styles such as avante garde to documentary shorts.",
    "credits": 0.5,
    "prerequisite": "Photography 1",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 3
  },
  {
    "id": "BARRY TECH Trade and Technical Program",
    "dept": "BOCES",
    "code": "180001 / 180002",
    "title": "BARRY TECH AM and BARRY TECH PM Trade and Technical Program",
    "description": "Barry Tech. offers a wide variety of trade and technical programs that you can read about on their website, www.barrytech.org. Students selecting this program can earn FOUR (4) school credits per year. Each student spends 1/2 day (A.M. or P.M.) at a Barry Tech. Center. The remaining 1/2 day is devoted to study in elective or required subjects for graduation. Transportation to and from the Barry Tech. Center is provided by the Great Neck School System. Programs include: Business/Information Services, Health Services, Engineering Technologies, Human and Public Services, Agricultural Sciences, and Arts and Humanities.",
    "credits": 4.0,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Vocational",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 4
  },
  {
    "id": "Sports & Entertainment Marketing",
    "dept": "Business/Technology",
    "code": "601",
    "title": "Sports & Entertainment Marketing",
    "description": "A one-semester course that involves all aspects of business marketing through the vehicle of the worlds of sports and entertainment. Students may study theories of product development, advertising, publicity, pricing, promotion, public relations and research. Projects, simulations and class work will enable students to enhance and use their knowledge.",
    "credits": 0.5,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 6
  },
  {
    "id": "Sports & Entertainment Management",
    "dept": "Business/Technology",
    "code": "602",
    "title": "Sports & Entertainment Management",
    "description": "A one-semester course that will continue to build on the elements of Sports Marketing. This class will cover sports management from the amateur level on through to professional sports teams. Event planning, player contract negotiations, management strategies and day to day operations will be some of the topic areas discussed. The current state of various sports teams and their impact on the world of business will also play a large part in class discussions and projects.",
    "credits": 0.5,
    "prerequisite": "Sports Marketing",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 6
  },
  {
    "id": "Web Design",
    "dept": "Business/Technology",
    "code": "603",
    "title": "Web Design",
    "description": "A one-semester course to instruct students in the fundamental methods of web page design and the Internet as a research tool. Students will learn how to download, import graphics, create internal and external hyperlinks, and many other web page design techniques. Microsoft Front Page will be used to facilitate instruction.",
    "credits": 0.5,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 6
  },
  {
    "id": "Intro to Business",
    "dept": "Business/Technology",
    "code": "606",
    "title": "Intro to Business",
    "description": "Learn the practical side of business. Checking accounts, insurance, consumer law, careers in business and more will be explored. Sociological, economic and technological issues and its affect on careers and personal resources will be studied. Daily life skills as well as decision-making, lifestyle goals and resources will be a part of this hands on course. Learn how to budget using basic banking skills and know your legal and consumer rights.",
    "credits": 0.5,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 6
  },
  {
    "id": "Fashion Marketing",
    "dept": "Business/Technology",
    "code": "609",
    "title": "Fashion Marketing",
    "description": "Fashion is part of our everyday lives. Everyone wears and buys clothes. Styles change from year to year and season to season creating new trends and demand. The fashion industry has an impact on student lives and the American and global economy. This course will introduce students to the marketing strategies used to develop, distribute and showcase today’s fashion. This will also help students develop an awareness of career options, aptitudes and future career decisions.",
    "credits": 0.5,
    "prerequisite": "none",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 6
  },
  {
    "id": "Fashion Marketing II",
    "dept": "Business/Technology",
    "code": "610",
    "title": "Fashion Marketing II",
    "description": "This one-semester course is a continuation of the Fashion Marketing I course. This class will be project-based and students will be able to implement ideas, previous fashion knowledge and design into real-world applications of clothing and visual merchandising. This will be integrated with a global view on fashion and also the various economic issues affecting the fashion industry.",
    "credits": 0.5,
    "prerequisite": "Fashion Marketing I",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 6
  },
  {
    "id": "College Marketing",
    "dept": "Business/Technology",
    "code": "615",
    "title": "College Marketing",
    "description": "This rigorous one semester course is designed as a college level course that will increase student knowledge and appreciation of how economic/demographic, social/cultural, practical and legal trends are connected to trade and the marketplace in the business world. The U.S., global and international role of marketing will be considered. Both marketing mix and strategy will be studied. Students can earn 3 college credits for the successful completion of this course.",
    "credits": 0.5,
    "prerequisite": "Grades 10, 11 and 12",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 6
  },
  {
    "id": "Advertising",
    "dept": "Business/Technology",
    "code": "617",
    "title": "Advertising",
    "description": "This course is designed for the student who wants to learn about the world of advertising. Students will learn how to develop an advertising campaign covering the development of company logos, slogans, and signage. The class will also cover the proper methods for layout, design and new product introduction. Students will also develop print, radio and television spots to coincide with various projects throughout the class. Students will be encouraged to develop campaigns for programs within the school and local businesses and will work closely with video communications course shooting actual television commercials.",
    "credits": 0.5,
    "prerequisite": "Grades 10, 11 and 12",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 7
  },
  {
    "id": "Accounting",
    "dept": "Business/Technology",
    "code": "623",
    "title": "Accounting",
    "description": "Money is not the root of all evil. In the business world it is the way we make exchanges. This course involves business and personal transactions. Through exercises, problem solving, and short projects, students learn to interpret and handle accounts. Calculators are needed. Computers will be used when applicable. Combined with another 1/2 year of accounting, this course may meet the fourth year mathematics requirement.",
    "credits": 0.5,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 7
  },
  {
    "id": "College Virtual Enterprises",
    "dept": "Business/Technology",
    "code": "637",
    "title": "College Virtual Enterprises",
    "description": "With an emphasis on college and career readiness, VEI is an in-school, live, global business simulation that offers students a competitive edge through project-based, collaborative learning and the development of 21st century skills in entrepreneurship, global business, problem solving, communication, personal finance and technology. Students can earn 3-6 college credits for the successful completion of this course.",
    "credits": 1.0,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 7
  },
  {
    "id": "College Management",
    "dept": "Business/Technology",
    "code": "640",
    "title": "College Management",
    "description": "A rigorous college level course designed to provide a basic understanding of the essential elements of management. It will introduce the concepts of management functions including planning, organizing, leading and controlling from a historical and contemporary perspective. Practical applications of management theory will be applied with a basic skills approach. Communication, problem solving, teamwork, decision-making, conflict resolution, critical and ethical analysis and reasoning will be introduced. The course will foster the management skills necessary for a successful future in the business and global environment. Students can earn 3 college credits for the successful completion of this course.",
    "credits": 0.5,
    "prerequisite": "10, 11, 12 grade",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 7
  },
  {
    "id": "College Law",
    "dept": "Business/Technology",
    "code": "642",
    "title": "College Law",
    "description": "(This course may be used to satisfy a five-year Social Studies sequence.) A practical subject providing an understanding of civil and criminal law with an emphasis on civil law. Through an examination of case problems and the legal activity behind daily news stories, students will develop an awareness of everyone's involvement with the law and how it affects daily living. Civil law, criminal law, contracts, bailments, automobile insurance, real and personal property, wills and family law are overviewed. Students can earn 3 college credits for the successful completion of this course.",
    "credits": 1.0,
    "prerequisite": "enrolled in grades 10,11 or 12",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 8
  },
  {
    "id": "Investments",
    "dept": "Business/Technology",
    "code": "655",
    "title": "Investments",
    "description": "\"How to Make Money Work for You\" is the theme of this semester course. This course is designed to build practical knowledge of investing and how to use money effectively. The topics covered are the stock market, bonds, mutual funds, real estate and other investments. Prudent involvement with the stock market will be explored and Newsday's Stock Market Contest may be entered. Current periodicals will be used. Guest speakers may be invited.",
    "credits": 0.5,
    "prerequisite": "enrolled in grades 11 and 12",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 8
  },
  {
    "id": "Real Estate Fundamentals",
    "dept": "Business/Technology",
    "code": "0657",
    "title": "Real Estate Fundamentals",
    "description": "This course is designed for students who are interested in understanding the economic and behavioral aspects of real estate markets. Our goal is to teach cutting-edge real estate related knowledge, and to produce future leaders in the real estate and related fields. The course helps students understand important concepts and issues making crucial business decisions, and creating effective public policies. Currently, the minimum age to obtain a Real Estate license in New York State is 18. This course can serve as a foundation for students interested in pursuing their Real Estate license at a later time.",
    "credits": 0.5,
    "prerequisite": "Introduction to Business",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 8
  },
  {
    "id": "Video Communications",
    "dept": "Business/Technology",
    "code": "665",
    "title": "Video Communications",
    "description": "This class is designed to provide an in-depth study in the field of video production to our students. This class would provide the student interested in video production with a strong foundation. Many filming, editing and digital production techniques will be utilized. Students will be able to film raw footage and go through the complete production process and turn out a polished and finished video piece. The class would be a half year and could be used to satisfy the computer application requirement. It would be open to all grades and could be taken numerous times.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 8
  },
  {
    "id": "Set Design and Construction",
    "dept": "Business/Technology",
    "code": "670",
    "title": "Set Design and Construction",
    "description": "This Set Design and Construction class will focus on the many aspects of designing and constructing sets and scenery for the various school productions. Students will be involved in stage model building, flat construction, and many other facets of the theater. The students will have opportunities during class to actually work on the live stage in all of its many areas. The student may repeat the class for additional credits upon instructor’s approval. Interested students will be able to register through Five Towns College and earn college credit.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Can earn college credit (Five Towns College). Student Requests Accepted Yes",
    "source_page": 8
  },
  {
    "id": "Know Your Car",
    "dept": "Business/Technology",
    "code": "671",
    "title": "Know Your Car",
    "description": "This course is a must for all students who intend to drive a car. The operation and functions of all mechanical components are covered. Consumer knowledge is stressed. Lab work and lectures cover everything from \"buying a car\" to doing maintenance and repairs. Auto ownership is not a prerequisite.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "11th and 12th graders only. Student Requests Accepted No",
    "source_page": 8
  },
  {
    "id": "Architectural Drawing",
    "dept": "Business/Technology",
    "code": "672",
    "title": "Architectural Drawing",
    "description": "This is a course in architectural drafting and design. Emphasis will be placed on residential planning and construction concepts. Students will be introduced to the materials and techniques used in the construction industry. Students will learn the rudiments of computer assisted design. Students may opt for a second semester of advanced work. This course meets the graphics or C.A.D. portion of the Computer Skills requirement or the art, music, drama requirement. Students can earn 3 college credits for the successful completion of this course and the Advanced Architecture course.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 9
  },
  {
    "id": "Advanced Architectural Drawing",
    "dept": "Business/Technology",
    "code": "673",
    "title": "Advanced Architectural Drawing",
    "description": "This class is designed to give additional exposure in the Architectural field of study. For years, our Architectural Drawing Program has given a wide variety of students at all grade levels an introduction to the world of Architecture. This class is for students who want a deeper study in the field. In this class, additional study, more detailed drawing, hand drawing, model making, and landscape design are areas where advanced students can challenge themselves and become more equipped to handle the coursework that they might come across at a higher level of education. This class may be taken for additional credit. This fulfills 1/2 the Art, Music and Drama requirement or 1/2 the Computer requirement. Students can earn 3 college credits for the successful completion of this course and the Architectural Drawing course.",
    "credits": 0.5,
    "prerequisite": "Architectural Drawing and Grades 10, 11 and 12",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Advanced",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 9
  },
  {
    "id": "Furniture Design and Construction",
    "dept": "Business/Technology",
    "code": "674",
    "title": "Furniture Design and Construction",
    "description": "This course will allow students who have completed the course in Personal Projects to further their studies in the area of furniture design and construction. It will provide students with a further look into the use of tools, equipment, and design processes when constructing furniture. Students will ultimately design and build their own detailed piece of furniture. This course is available to students on all grade levels and may be repeated for credit.",
    "credits": 0.5,
    "prerequisite": "Personal Projects or permission of instructor",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 9
  },
  {
    "id": "Individual Projects Lab",
    "dept": "Business/Technology",
    "code": "675",
    "title": "Individual Projects Lab",
    "description": "This is a \"how to\" and \"hands on\" course designed to fit the needs of the individual. It provides a wonderful opportunity to design and construct projects of your choice. It will help you to understand and use tools and equipment used in woodworking and plastics. This course is open to all students, but is designed for the non-technology major who is interested in learning new skills. It may be repeated for additional credit.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 9
  },
  {
    "id": "PC Repair-A+Certification",
    "dept": "Business/Technology",
    "code": "683",
    "title": "PC Repair-A+Certification",
    "description": "Students will learn to diagnose and repair computer hardware and software problems. The course will include computer theory, disk operating systems, diagnostic procedures for PC's and actual lab experiences in computer repair, upgrading, networking, and configuration. This course is appropriate for those who seek entry level career skill development, and for seasoned computer users who wish to elevate their practical competence to higher levels. This course will support a substantial part of the Computer Skills requirement. It is recommended that students take the A+ Certification Exam at the conclusion of the course.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 9
  },
  {
    "id": "Intro to Computer Aided Design",
    "dept": "Business/Technology",
    "code": "0684",
    "title": "Intro to Computer Aided Design",
    "description": "This class is designed to provide students with an understanding of the fundamental concepts related to communicating engineering related technical information/design ideas using Computer Aided Design. Through a series of hands-on computer based experiences, students will become familiar with the sketching, lettering scale drawing, print reading, visualization dimensioning and problem solving techniques used by engineers and designers. They will use CAD and rendering software throughout the course to produce 2 and 3 dimensional drawings of solutions to engineering-related problems and 3-D printing technology to generate effective prototypes and models. This course fills the 1/2 graphics or CAD portion of the Computer Skills requirement or 1/2 the Art, Music and Drama requirement.",
    "credits": 0.5,
    "prerequisite": "Grades 10,11, and 12",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 10
  },
  {
    "id": "Robotics",
    "dept": "Business/Technology",
    "code": "685",
    "title": "Robotics",
    "description": "This class will provide an in-depth study in the field of robotics. Students will focus on many design, model building, troubleshooting, electronic, and physics based concepts. It will provide not only specific building and running of the robot through computer programs, but also gives students firsthand knowledge of how an engineer-based organization is run. This full-year class is open to 11th and 12th grade students, and can be used to satisfy the third year of Science requirement. Students can earn 3 college credits for the successful completion of this course.",
    "credits": 1.0,
    "prerequisite": "11th and 12th grade only",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Can earn 3 college credits. Student Requests Accepted No",
    "source_page": 10
  },
  {
    "id": "Robotics Advanced",
    "dept": "Business/Technology",
    "code": "0686",
    "title": "Robotics Advanced",
    "description": "This class is available to students who have completed the Robotics class and will provide a further in-depth study in the field of Robotics. Students will focus on many design, model building, troubleshooting, electronic, and physics based concepts. It will provide not only specific building and running of the robot through computer programs, but also gives students firsthand knowledge of how an engineer-based organization is run. This full-year class is open to 12th grade students, and can be used to satisfy the third year of Science requirement. If students have not earned college credit through \"Robotics\", they can earn 3 college credits for the successful completion of this course.",
    "credits": 1.0,
    "prerequisite": "successful completion of Robotics class",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Advanced",
    "repeatable": false,
    "additional_notes": "Can earn 3 college credits. Student Requests Accepted No",
    "source_page": 10
  },
  {
    "id": "Introduction to Engineering",
    "dept": "Business/Technology",
    "code": "690",
    "title": "Introduction to Engineering",
    "description": "This one-semester course will introduce students to the basic elements of mechanical, electrical, civil, biomedical, environmental and aerospace engineering. Students will have the ability to develop skills and understanding of course concepts through activities, projects, problem-based learning exercises and other team building activities. Students will get to fully understand the processes that engineers go through when working on any given project.",
    "credits": 0.5,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 10
  },
  {
    "id": "English 9R",
    "dept": "English",
    "code": "112",
    "title": "English 9R",
    "description": "This course is for the majority of freshmen and includes study and activities in composition, literature, language, and speech. The emphasis in composition will be on the process of writing, with students having at least one writing experience per week in addition to acquiring note-taking skills. Freshmen will study novels, short stories, poems, plays, and nonfiction. Language study includes vocabulary development and the mechanics of written expression, especially grammar. An introduction to research techniques and the writing of a research paper are additional elements of this course.",
    "credits": 1.0,
    "prerequisite": "English 8",
    "grade_levels": [
      "9"
    ],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 11
  },
  {
    "id": "English 9 Honors",
    "dept": "English",
    "code": "113",
    "title": "English 9 Honors",
    "description": "This course parallels the work of English 9 but progresses at a faster pace and goes into greater depth. It is planned for especially able freshmen who are mature and capable enough to do advanced work and who are eager to meet the challenge of greater demands than those made upon students in the regular English course. Honors students should expect and enjoy challenging assignments in reading, analysis of literature, writing, and speaking. Students should also have strong expository writing skills.",
    "credits": 1.0,
    "prerequisite": "Teacher recommendation.",
    "grade_levels": [
      "9"
    ],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 11
  },
  {
    "id": "English 9/10 (for ENL students)",
    "dept": "English",
    "code": "115",
    "title": "English 9/10 (for ENL students)",
    "description": "This course is designed for ENL and former ENL students. The course reflects the NYS English Language Arts standards and focuses on developing reading, writing, listening, and speaking skills.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [
      "9",
      "10"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 11
  },
  {
    "id": "English 10R",
    "dept": "English",
    "code": "122",
    "title": "English 10R",
    "description": "This course is for the majority of sophomores and includes study and activities in composition, literature, language, and speech. Instruction and practice in the process of writing begins with the expository paragraph and progresses to full-length essays; creative writing may parallel the literature studied. Language study includes vocabulary development and the mechanics of written expression, especially grammar. Sophomores will study representative works of fiction, drama, nonfiction, and poetry, with emphasis on critical reading and analysis of literature. Students will also complete a research paper following the guidelines of the MLA Handbook.",
    "credits": 1.0,
    "prerequisite": "English 9R",
    "grade_levels": [
      "10"
    ],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 11
  },
  {
    "id": "English 10 Honors",
    "dept": "English",
    "code": "123",
    "title": "English 10 Honors",
    "description": "This course parallels the work of English 10 but progresses at a faster pace and goes into greater depth. It is planned for especially able sophomores who are mature and capable enough to do advanced work and who are eager to meet the challenge of greater demands than those made upon students in the regular English course. Honors students should expect and enjoy challenging assignments in reading, analysis of literature, writing, and speaking.",
    "credits": 1.0,
    "prerequisite": "Teacher recommendation",
    "grade_levels": [
      "10"
    ],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 11
  },
  {
    "id": "English 11R",
    "dept": "English",
    "code": "133",
    "title": "English 11R",
    "description": "This course prepares students for the English Regents examination and emphasizes the skills required to meet New York State’s learning standards for English Language Arts. English 11 includes study and activities in composition, literature, language, and speech. Focusing on American literature, this course emphasizes representative themes and the historical, literary, and social factors affecting the composition of literary works. Students will study nonfiction, analyze prose, and write in a variety of modes for a variety of purposes. Students will also complete a research paper following the guidelines of the MLA Handbook.",
    "credits": 1.0,
    "prerequisite": "English 10R",
    "grade_levels": [
      "11"
    ],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 11
  },
  {
    "id": "Advanced Placement English Language and Composition",
    "dept": "English",
    "code": "134",
    "title": "Advanced Placement English Language and Composition",
    "description": "The Advanced Placement Language and Composition course in English is a college-level course that teaches students to read and understand complex texts and to write prose of sufficient richness and complexity to communicate effectively with mature readers. Students will write in a variety of forms and on a variety of subjects, but with an emphasis on the argument essay. Writing and reading will help students to analyze expectations as well as an author's purpose, bias, and effective use of conventions and resources of language. This course prepares students for the 12th grade Advanced Placement course in English and for writing at the college level. Because of the challenging nature of this course, a high level of achievement in English 10 is required. Students will also complete a research paper following the guidelines of the MLA Handbook. *Students enrolled in the AP Language and Composition course are required to take the Advanced Placement exam in May.",
    "credits": 1.0,
    "prerequisite": "Teacher recommendation",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 12
  },
  {
    "id": "English 11/12 (for ENL students)",
    "dept": "English",
    "code": "136",
    "title": "English 11/12 (for ENL students)",
    "description": "This course is designed for 11th and 12th grade ENL and former ENL students who would benefit from two years of preparation for the English Regents exam.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 12
  },
  {
    "id": "English Regents 11/12 (for ENL students)",
    "dept": "English",
    "code": "137",
    "title": "English Regents 11/12 (for ENL students)",
    "description": "This course prepares 11th and 12th grade ENL and former ENL students for the English Regents.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 12
  },
  {
    "id": "Advanced Placement English Literature and Composition",
    "dept": "English",
    "code": "142",
    "title": "Advanced Placement English Literature and Composition",
    "description": "The Advanced Placement course in Literature and Composition is a college-level course designed for the more able English student who is willing to accept the challenge of advanced work. AP English Literature includes close reading and analysis of selected works of undisputed literary excellence, the development of an intellectual approach to reading and writing, and work in composition that is more advanced than what is usually expected of high school seniors. For this reason, AP Literature students should have exceptionally strong writing skills before beginning the course. Students will also complete a research paper following the guidelines of the MLA Handbook. A high level of achievement in English 11 is required. *Students enrolled in the AP Literature and Composition course are required to take the Advanced Placement exam in May.",
    "credits": 1.0,
    "prerequisite": "Teacher recommendation",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 12
  },
  {
    "id": "Facing History English",
    "dept": "English",
    "code": "150",
    "title": "Facing History English",
    "description": "Facing History is a unique program for students who want to make a difference in our school, local, and global communities. This course is designed to increase tolerance and multicultural understanding through literature, history, psychology, service learning, and research. It is co-taught by a team of teachers from the English, Social Studies, Library, and Internship departments. This program satisfies the English and Social Studies requirements for senior year as well as an elective credit. Second semester includes an off-site service-based internship that provides an opportunity for civic engagement to promote upstander behavior. In the English component of this program, we use poetry, fiction, non-fiction, and film to explore philosophical and psychological concepts like human nature and the foundations of human knowledge. Furthermore, we examine how psychological concepts like bias, prejudice, and compliance influence that knowledge and lead to inhuman behaviors and actions against others. We use art, literature, and Holocaust testimony as a lens to explore the human condition and to consider the questions that arise whenever our fellow human beings witness, cause, or suffer inhumanity. *This course meets the English requirement for the NCAA eligibility.",
    "credits": 1.0,
    "prerequisite": "SENIORS ONLY.",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Corequisite: Enrollment in Facing History Social Studies, Facing History Leadership & Media Studies and Facing History Internship. Student Requests Accepted No",
    "source_page": 13
  },
  {
    "id": "Facing History: Research (Leadership & Media Studies)",
    "dept": "English",
    "code": "0151",
    "title": "Facing History: Research (Leadership & Media Studies)",
    "description": "Facing History is a unique program for students who want to make a difference in our school, local, and global communities. This course is designed to increase tolerance and multicultural understanding through literature, history, psychology, service learning, and research. It is co-taught by a team of teachers from the English, Social Studies, Library, and Internship departments. This program satisfies the English and Social Studies requirements for senior year as well as an elective credit. Second semester includes an off-site service-based internship that provides an opportunity for civic engagement to promote upstander behavior. Using the core themes and components from the aforementioned courses, the leadership and media component of the program focuses on 21st century learning skills while helping to prepare students for the college experience. Students will individually investigate historical examples of injustice, bigotry, and intolerance not necessarily discussed in the other sections. Students will learn responsible use and creation of information sources while developing academic writing skills, devising individual technology projects, and performing community outreach. The overarching goal is to increase understanding of others while developing student and community leaders.",
    "credits": 1.0,
    "prerequisite": "SENIORS ONLY.",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Corequisite: Enrollment in Facing History Social Studies, Facing History Research and Facing History Internship. Student Requests Accepted No",
    "source_page": 13
  },
  {
    "id": "Reading and Research Workshop",
    "dept": "English",
    "code": "156",
    "title": "Reading and Research Workshop",
    "description": "This course is designed for college-bound seniors who wish to improve their research skills. The course focuses on the process of writing the research paper: choosing a topic; researching, evaluating, documenting, and integrating sources; and outlining, drafting, and polishing the final essay.",
    "credits": 0.5,
    "prerequisite": "English 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 13
  },
  {
    "id": "The Short Story",
    "dept": "English",
    "code": "0157",
    "title": "The Short Story",
    "description": "In this course, students will survey the short story genre from the nineteenth century to the present. The reading list will include representative works from major American writers of fiction, such as Hawthorne, Poe, O. Henry, Chopin, Steinbeck, Faulkner, and Hemingway. Through the reading, discussion, and written analysis of these literary works, students will further develop their close reading skills and their appreciation for the short story genre. This course will also include a research component.",
    "credits": 0.5,
    "prerequisite": "English 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 14
  },
  {
    "id": "Great Themes in Literature",
    "dept": "English",
    "code": "0158",
    "title": "Great Themes in Literature",
    "description": "Great Themes in Literature is designed for students who enjoy exploring universally relevant ideas, such as evil and revenge, conformity and rebellion, survival and death, love and hate, self-perception and perception of others. The timeless quality of these themes allows for the study of both classical and contemporary authors. This course will also include a research component.",
    "credits": 0.5,
    "prerequisite": "English 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 14
  },
  {
    "id": "Feminist Literature",
    "dept": "English",
    "code": "0159",
    "title": "Feminist Literature",
    "description": "This course will offer an in-depth experience with works by and about women. As we read both fiction and nonfiction, we will explore, interpret, and discuss the many ways women have chosen to portray themselves and their world. Whether you are passionate about Women's Studies and history or are looking to discover a new literary perspective, this course may be for you.",
    "credits": 0.5,
    "prerequisite": "English 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 14
  },
  {
    "id": "Creative Writing",
    "dept": "English",
    "code": "0165",
    "title": "Creative Writing",
    "description": "This course is for the student who is passionate about writing. Students will focus on memoir and poetry writing for catharsis and self discovery. Polished pieces are developed in stages, beginning with raw material in the student's journal. Readings include several forms of creative writing as models for writing done in class.",
    "credits": 0.5,
    "prerequisite": "Teacher recommendation",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 14
  },
  {
    "id": "Rhetoric of the Moving Image",
    "dept": "English",
    "code": "0166",
    "title": "Rhetoric of the Moving Image",
    "description": "In this course, students will analyze films from around the world. Through a variety of critical and imaginative assignments, they will learn to interpret films by exploring subtexts and motifs and by conducting written mise en scene analyses. Students will contribute to a class blog, an online journal, where they will reflect on the films shown in class. They will also write an MLA-style research paper on a director’s canon and style. As a final exam, students will demonstrate what they have learned in the course by collaboratively writing, filming, and editing a short film of their own. *This course does not meet the English requirements for the NCAA eligibility.",
    "credits": 0.5,
    "prerequisite": "English 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 14
  },
  {
    "id": "Modern Drama",
    "dept": "English",
    "code": "0173",
    "title": "Modern Drama",
    "description": "In this course students will identify the features of modern drama by reading such plays as The Zoo Story, One Flew Over the Cuckoo’s Nest, A Streetcar Named Desire, and Lost in Yonkers. Students will also perform scenes in class and write criticism. This course will also include a research component.",
    "credits": 0.5,
    "prerequisite": "English 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 14
  },
  {
    "id": "Shakespeare",
    "dept": "English",
    "code": "0174",
    "title": "Shakespeare",
    "description": "You have read Julius Caesar, Romeo and Juliet, and Macbeth. But what about the other 36 plays? This is your last chance before college to read and perform some of Shakespeare's other hits. The students in this course will read the texts closely, participate in group performances, study the sonnets, and recreate the world of Elizabethan and Jacobean theater. This course will also include a research component.",
    "credits": 0.5,
    "prerequisite": "English 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "SENIORS ONLY. Student Requests Accepted No",
    "source_page": 15
  },
  {
    "id": "Journalism",
    "dept": "English",
    "code": "180",
    "title": "Journalism",
    "description": "This course is designed primarily for ninth, tenth, and eleventh graders who wish to become more active members of The Southerner staff. In this course, students will analyze news, feature, editorial, sports, and entertainment articles and then write articles of their own. They will be introduced to the principles of copyediting and newspaper design and will practice these skills as members of The Southerner staff. As the final exam, students will learn to use InDesign software as they create and print their own original newspapers. Course must be taken in addition to regular English class",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [
      "9",
      "10",
      "11"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 15
  },
  {
    "id": "Journalism Advanced H",
    "dept": "English",
    "code": "0181",
    "title": "Journalism Advanced H",
    "description": "Advanced Journalism is designed for students who have successfully completed Journalism and who are members of The Southerner staff. This course will provide students the opportunity to work on editing and layout for each issue during the school day. All students interested in leadership positions on The Southerner are encouraged to register for this course.",
    "credits": 0.5,
    "prerequisite": "Journalism",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Co-requisite: Member of Southerner Staff. Student Requests Accepted No",
    "source_page": 15
  },
  {
    "id": "Graphic Literature",
    "dept": "English",
    "code": "0182",
    "title": "Graphic Literature",
    "description": "The study of alternate modes of storytelling, in both fiction and non-fiction, through the use of short and full-length graphic texts. This course will help to build on the familiarity students already have with the genre to more systematically explore the power of communicating with text and image. Along with the Graphic Novel art class will help with approaching literature as an interdisciplinary study.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 15
  },
  {
    "id": "Advanced Filmmaking",
    "dept": "English",
    "code": "890",
    "title": "Advanced Filmmaking",
    "description": "Advanced Film is a course that will explore the world of DSLR filmmaking and professional video editing! Camera, scriptwriting, audio mixing, acting, and cinematic techniques will also be explored. Projects worked on in class include music videos, comedic, dramatic, and suspenseful films, and more! Final Cut Pro and Premiere are just some of the exciting software we will be using. Students will have the opportunity to have their films broadcast on our district channels for our \"Great Neck Filmmakers Showcase\" program! Students will also be encouraged to use their filmmaking skills for programs that air on our school cable channels Cablevision TV 75 and Verizon Fios Channel 32, as well as join our GNPS TV Independent Study program. Many students use segments from programs they help to produce as part of their college entrance requirements.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 15
  },
  {
    "id": "ENL 1",
    "dept": "ENL",
    "code": "1610",
    "title": "ENL 1",
    "description": "ENL is for speakers of other languages who are recent arrivals in this country. The four basic communication skills - listening, speaking, reading and writing - are emphasized through a variety of activities. ENL also helps English Language Learners (ELLs) adjust as quickly as possible to the mainstream of the school and to the community. Students are grouped according to ability in English - beginning, intermediate, and advanced.",
    "credits": 1.0,
    "prerequisite": "recommended by ENL instructor and GuidanceCounselor",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 16
  },
  {
    "id": "ENL 2",
    "dept": "ENL",
    "code": "1620",
    "title": "ENL 2",
    "description": "ENL is for speakers of other languages who are recent arrivals in this country. The four basic communication skills - listening, speaking, reading and writing - are emphasized through a variety of activities. ENL also helps English Language Learners (ELLs) adjust as quickly as possible to the mainstream of the school and to the community. Students are grouped according to ability in English - beginning, intermediate, and advanced.",
    "credits": 1.0,
    "prerequisite": "recommended by ENL instructor and Guidance Counselor",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 16
  },
  {
    "id": "ENL III",
    "dept": "ENL",
    "code": "1630",
    "title": "ENL III",
    "description": "ENL is for speakers of other languages who are recent arrivals in this country. The four basic communication skills - listening, speaking, reading and writing - are emphasized through a variety of activities. ENL also helps English Language Learners (ELLs) adjust as quickly as possible to the mainstream of the school and to the community. Students are grouped according to ability in English - beginning, intermediate, and advanced.",
    "credits": 1.0,
    "prerequisite": "recommended by ENL instructor and Guidance Counselor",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 16
  },
  {
    "id": "ENL Seminar",
    "dept": "ENL",
    "code": "1650",
    "title": "ENL Seminar",
    "description": "This course, designed for ENL students in English 11/12 and English Regents, provides extra reading, writing, listening and speaking practice for students who will be taking the English Regents.",
    "credits": 0.5,
    "prerequisite": "recommended by ENL instructor and Guidance Counselor",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 16
  },
  {
    "id": "Food Science",
    "dept": "FACS",
    "code": "0668",
    "title": "Food Science",
    "description": "This interdisciplinary course will provide students with exposure to specific careers in science, food, and technology as well as authentic, hands-on lab experimentation. Students will work in the foods lab to explore the scientific reactions that cause and affect our favorite foods. We will investigate current food and nutrition trends such as sustainability, specialized diets, food processing, and molecular gastronomy.",
    "credits": 0.5,
    "prerequisite": "None",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 17
  },
  {
    "id": "Health 9",
    "dept": "Health",
    "code": "1031",
    "title": "Health 9",
    "description": "(Required Course) This course will offer topics which will be useful for incoming 9th grade students and assist them in making the transition to high school. Course topics will also include nutrition, vaping, exercise, drugs and alcohol, and other important adolescent health topics.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [
      "9"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 18
  },
  {
    "id": "Health 11",
    "dept": "Health",
    "code": "1033",
    "title": "Health 11",
    "description": "(Required Course) This is the New York State mandated Health Education course that covers information related to adolescent physical, emotional and social well-being. Topics include smoking, vaping, nutrition, drug and alcohol use as well as other important adolescent health topics.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [
      "11"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 18
  },
  {
    "id": "Career Internship Program",
    "dept": "Internship",
    "code": "800",
    "title": "Career Internship Program",
    "description": "This program provides an opportunity for students in grades 10 - 12 to experience a “career” or field of interest before they leave the high school environment. Volunteering for 50 hours per semester will entitle the student to 1/2 of an elective credit on their transcript. Students can receive assistance in choosing their Internship placement, or find one on their own. The Internship Coordinator will approve the placement and supervise the student during the semester. Primary Requirements: 1. Volunteer 50 hours per semester 2. Provide own transportation 3. Complete a series of assignments over the course of the semester 4. Behave in a professional and appropriate manner. This community based learning experience will allow students to gain exposure to a career, gain hands-on work experience, and have the opportunity to meet professionals in the field. They will also gain exposure to the world of work including developing a resume, arranging and going on interviews, maintaining a commitment to a job placement, and operating in a professional manner.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 19
  },
  {
    "id": "ENL Algebra 1",
    "dept": "Mathematics",
    "code": "03001",
    "title": "ENL Algebra 1",
    "description": "This course follows the NYS Algebra 1 curriculum. This course is designed for students who are enrolled in our ENL program.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 20
  },
  {
    "id": "Algebra 1",
    "dept": "Mathematics",
    "code": "0301",
    "title": "Algebra 1",
    "description": "Algebra 1 is the first year in the NYS \"Story of Functions\" curriculum. The focus of this course is to deepen and extend understanding of linear, exponential and quadratic expressions, equations, and functions. A descriptive statistics unit is included and there is emphasis on modeling and use of equations to solve real world problems. Regents exam required.",
    "credits": 1.0,
    "prerequisite": "Math 8",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 20
  },
  {
    "id": "Algebra 1 Lab",
    "dept": "Mathematics",
    "code": "0302",
    "title": "Algebra 1 Lab",
    "description": "Lab course corresponding to Algebra 1.",
    "credits": 0.0,
    "prerequisite": "Teacher recommendation and Department Head approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "No credit. Student Requests Accepted No",
    "source_page": 20
  },
  {
    "id": "Geometry",
    "dept": "Mathematics",
    "code": "0310",
    "title": "Geometry",
    "description": "Geometry is the second year in the NYS “Story of Functions” curriculum. The focus of this course is deepening explanations of geometric relationships, moving towards formal mathematical arguments. Transformations are emphasized early in this course and are utilized to reinforce the ideas of congruence and similarity. Regents exam required.",
    "credits": 1.0,
    "prerequisite": "Completion of Algebra 1; passing grade on Regents exam",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 20
  },
  {
    "id": "Geometry Lab",
    "dept": "Mathematics",
    "code": "0312",
    "title": "Geometry Lab",
    "description": "Lab course corresponding to Geometry.",
    "credits": 0.0,
    "prerequisite": "Teacher recommendation and Department Head approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "No credit. Student Requests Accepted No",
    "source_page": 20
  },
  {
    "id": "Geometry Honors",
    "dept": "Mathematics",
    "code": "0316",
    "title": "Geometry Honors",
    "description": "This course is designed for students whose performance in Algebra 1 has been consistently above average and who possess keen mathematical insight. The content from the NYS Geometry curriculum (see above) will be covered in depth and with enrichment. Regents exam required.",
    "credits": 1.0,
    "prerequisite": "Completion of Algebra 1 with a minimum course grade of 90; minimum grade of 90 on the Algebra 1 regents; teacher and/or Department Head recommendation",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 20
  },
  {
    "id": "Algebra 2.1 Topics",
    "dept": "Mathematics",
    "code": "0320",
    "title": "Algebra 2.1 Topics",
    "description": "This is the first half of the third course in the NYS sequence for Mathematics which is required for the Advanced NYS Regents Diploma. This course covers polynomial, rational, logarithmic, exponential and radical functions. Students will work closely with the expressions that define the functions and continue to expand and increase their abilities to model situations.",
    "credits": 1.0,
    "prerequisite": "Completion of Algebra 1 and Geometry; passing grade on both Regents exams.",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 20
  },
  {
    "id": "Algebra 2",
    "dept": "Mathematics",
    "code": "0342",
    "title": "Algebra 2",
    "description": "Algebra 2 is the third year in the NYS \"Story of Functions\" curriculum. The focus of this course is to build on previous work with functions and extend the students knowledge of functions to include polynomial, rational, logarithmic, exponential, and radical functions. Students will work closely with the expressions that define the functions and continue to expand and increase their abilities to model situations. Trigonometric functions will be studied along with a unit on probability and statistics. Regents exam required.",
    "credits": 1.0,
    "prerequisite": "Completion of Geometry; passing grade on the Regents exams.",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 21
  },
  {
    "id": "Algebra 2 Lab",
    "dept": "Mathematics",
    "code": "0324",
    "title": "Algebra 2 Lab",
    "description": "Lab course corresponding to Algebra 2.",
    "credits": 0.0,
    "prerequisite": "Teacher recommendation and Department Head approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "No credit. Student Requests Accepted No",
    "source_page": 21
  },
  {
    "id": "Algebra 2 Honors",
    "dept": "Mathematics",
    "code": "0326",
    "title": "Algebra 2 Honors",
    "description": "This course is designed for students whose performance in Algebra 1 and Geometry has been consistently above average and who possess keen mathematical insight. The content from the Algebra 2 curriculum (see above) will be covered in depth and with enrichment. Regents exam required.",
    "credits": 1.0,
    "prerequisite": "Completion of Algebra 1 Honors and Geometry Honors with a minimum course grade of 85; minimum grade of 85 on both the Algebra 1 and Geometry Regents; teacher recommendation and Department Head approval.",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 21
  },
  {
    "id": "Algebra 2.2 and Pre-Calculus Topics",
    "dept": "Mathematics",
    "code": "0330",
    "title": "Algebra 2.2 and Pre-Calculus Topics",
    "description": "This course is for students who completed Algebra 2.1 Topics. Students will study trigonometric functions and a unit on probability and statistics. Regents exam in January is required. Students will study selected pre-calculus topics in the second semester.",
    "credits": 1.0,
    "prerequisite": "Algebra 2.1 Topics",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 21
  },
  {
    "id": "Trigonometry and Pre-Calculus Topics",
    "dept": "Mathematics",
    "code": "0346",
    "title": "Trigonometry and Pre-Calculus Topics",
    "description": "This course continues with the study of mathematics beyond Algebra 2. Students will study trigonometric functions, matrices, rational functions and other selected topics.",
    "credits": 1.0,
    "prerequisite": "Completion of Algebra 2; passing grade on the regents exam.",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 21
  },
  {
    "id": "Pre-Calculus",
    "dept": "Mathematics",
    "code": "0335",
    "title": "Pre-Calculus",
    "description": "This course continues the study of mathematics after Algebra 2. In the first semester, students will cover: vectors, trigonometry, complex numbers, and matrices. Students will then begin the study of calculus covering topics such as limits, the definition of the derivative, differentiation techniques, applications of differentiation, antidifferentiation, the definition of the integral, and techniques of integration. Throughout the course real-world applications will be emphasized. Students intending to continue study in mathematics or science should choose this course over any other mathematics course open to them.",
    "credits": 1.0,
    "prerequisite": "Algebra 2 with a minimum course grade of 80 and a minimum regents grade of 80.",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 21
  },
  {
    "id": "Pre-Calculus H",
    "dept": "Mathematics",
    "code": "0336",
    "title": "Pre-Calculus H",
    "description": "This course continues the study of mathematics after Algebra 2 Honors and is the fourth year in the NYS curriculum. It will cover the topics in Pre-calculus/Calculus in greater depth, with a theoretical approach, and at a faster pace. This course is designed to prepare students for AP Calculus.",
    "credits": 1.0,
    "prerequisite": "Algebra 2 Honors with a minimum course grade of 85 and a minimum regents grade of 85, teacher recommendation and Department Head approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 22
  },
  {
    "id": "College Statistics",
    "dept": "Mathematics",
    "code": "0340",
    "title": "College Statistics",
    "description": "This course will focus on the collection and analysis of data across fields of study. Students will read and critique studies from numerous sources looking at bias, validity of data collection, and inference. Students will be responsible for finding, analyzing and presenting studies from their own life on a regular basis. The course will include many projects and conclude with a capstone project. *Interested students will be able to register through St. John's University (Queens Campus) St. John's University College Advantage program and earn college credit.",
    "credits": 1.0,
    "prerequisite": "Algebra 2 with Department Head approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 22
  },
  {
    "id": "Statistics Advanced Placement",
    "dept": "Mathematics",
    "code": "0342",
    "title": "Statistics Advanced Placement",
    "description": "The purpose of Statistics AP is to introduce students to the major concepts and tools for collecting, analyzing, and drawing conclusions from data. Students are exposed to four broad conceptual themes: exploring data; planning a study; modeling using probability and simulation; statistical inference for confirming models. In May, members of the class are expected to take the College Board Advanced Placement Test in Statistics.",
    "credits": 1.0,
    "prerequisite": "Algebra 2 Honors or Pre-Calculus with a minimum grade of 90; teacher recommendation and Department Head approval",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 22
  },
  {
    "id": "Calculus Honors",
    "dept": "Mathematics",
    "code": "0350",
    "title": "Calculus Honors",
    "description": "This course will include the study of functions, techniques of graphing, limits, and continuity; the derivative and its applications, especially in the social sciences; techniques and applications of integration. The emphasis of this course will be on real-world uses of the calculus, with less emphasis on theoretical development than in the advanced placement courses.",
    "credits": 1.0,
    "prerequisite": "Pre-Calculus with a course grade of A or B, teacher recommendation and Department Head approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 22
  },
  {
    "id": "Calculus AB-Advanced Placement",
    "dept": "Mathematics",
    "code": "0351",
    "title": "Calculus AB-Advanced Placement",
    "description": "This course provides a detailed study of functions, graphs, limits, derivatives and their applications including slope fields, integrals and their properties and applications, and numerical approximations. In May, the members of the class are expected to take the College Board Advanced Placement test in the Calculus AB level.",
    "credits": 1.0,
    "prerequisite": "Pre-Calculus Honors with a minimum course grade of 85; teacher recommendation and department head approval",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 23
  },
  {
    "id": "Calculus BC - Advanced Placement",
    "dept": "Mathematics",
    "code": "0352",
    "title": "Calculus BC - Advanced Placement",
    "description": "This course is designed for top level honors students. It includes all of the topics in Calculus AB AP with the addition of: parametric, polar, and vector functions, numerical solution of differential equations using Euler’s method, L’Hopital’s rule and its use in determining convergence of improper integrals and series, the length of a curve, anti-derivatives by parts and partial fractions, and the study of series. In May, the members of the class are expected to take the College Board Advanced Placement test in Calculus BC AP.",
    "credits": 1.0,
    "prerequisite": "Teacher recommendation and Department Head approval. Pre-Calculus Honors with a minimum course grade of 95. It is strongly recommended that students take Physics concurrently or in the previous year.",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 23
  },
  {
    "id": "Introduction to Programming and JAVA",
    "dept": "Mathematics",
    "code": "0390",
    "title": "Introduction to Programming and JAVA",
    "description": "JAVA programming language will be introduced. Topics covered will be strings, arrays, graphics, loops, methods, and libraries. Standard programming syntax will be covered: variables, conditional statements, loops, functions, events, and concepts of object-oriented programming. JAVA’s Swing package for applets will be used.",
    "credits": 1.0,
    "prerequisite": "Algebra 1",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 23
  },
  {
    "id": "Advanced Placement Computer Science",
    "dept": "Mathematics",
    "code": "0393",
    "title": "Advanced Placement Computer Science",
    "description": "This course is equivalent to a one-year first level, college course in Computer Science. The programming language is JAVA. Topics include data structures (such as lists and arrays) In May, students are expected to take the College Board Advanced Placement test in Computer Science.",
    "credits": 1.0,
    "prerequisite": "Intro to JAVA. Corequisite: Algebra 2",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 23
  },
  {
    "id": "Data Structures Honors",
    "dept": "Mathematics",
    "code": "0394",
    "title": "Data Structures Honors",
    "description": "This course explores topics in computer science beyond what is covered in the AP curriculum and will be open to students who have completed AP Computer Science. The class continues the computer science sequence with the study of data structure and algorithms in a new programming language (C++).",
    "credits": 1.0,
    "prerequisite": "Completion of AP Computer Science",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 24
  },
  {
    "id": "Advanced Math Topics",
    "dept": "Mathematics",
    "code": "395",
    "title": "Advanced Math Topics",
    "description": "The class continues the advanced mathematics sequence with the study of Abstract Algebra.",
    "credits": 1.0,
    "prerequisite": "Completion of AP Calculus or currently enrolled in AP Calculus, teacher recommendation and Department Head approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Advanced",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 24
  },
  {
    "id": "Game Development H",
    "dept": "Mathematics",
    "code": "0396",
    "title": "Game Development H",
    "description": "This course explores topics in computer science beyond what is covered in the AP curriculum and will be open to students who have completed AP Computer Science. The class continues the computer science sequence with the study video game design and development using the Unity platform in a new (the students) programing Language (C#).",
    "credits": 1.0,
    "prerequisite": "Completion of AP Computer Science",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 24
  },
  {
    "id": "Beginning Acoustical Guitar",
    "dept": "Performing Arts/Music",
    "code": "905",
    "title": "Beginning Acoustical Guitar",
    "description": "This half-year course is designed for students with no previous guitar experience. Students will learn many of the different styles, skills and techniques required to become a successful guitarist. Skills to be learned include: correct posture and hand position, note reading, forming chords, scale patterns, fingerings, strumming, finger picking, flat picking and performing in class with the instructor.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 25
  },
  {
    "id": "Intermediate Acoustical Guitar",
    "dept": "Performing Arts/Music",
    "code": "906",
    "title": "Intermediate Acoustical Guitar",
    "description": "This course is designed for students that have either completed Beginner Acoustic Guitar or already have experience reading music on the Guitar. During this course, students will further their knowledge of the instrument through participation in a Guitar Ensemble. Students who enroll in this course will also have the option to participate in our Contemporary Music Club. Skills to be learned include barre chords, fretboard study, major/minor scales (two octave), improvisation, alternate tuning, and ensemble performance.",
    "credits": 0.5,
    "prerequisite": "Beginning Acoustical Guitar (recommended but not required)",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 25
  },
  {
    "id": "An Introduction to Music Technology",
    "dept": "Performing Arts/Music",
    "code": "907",
    "title": "An Introduction to Music Technology",
    "description": "Are you interested in composing your own original electronic music? This hands-on music elective teaches students how to create music using 21st century production tools such as Logic and GarageBand. In addition to making music, students will learn how to play piano and read music. All grade and skill levels welcome.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Can count for Music or Technology Credit. Student Requests Accepted Yes",
    "source_page": 25
  },
  {
    "id": "Piano Lab",
    "dept": "Performing Arts/Music",
    "code": "909",
    "title": "Piano Lab",
    "description": "This course will introduce basic keyboard skills including chords, scales and playing simple songs. Students will be able to perform in a classroom recital at the end of the semester. All students must be beginners on piano.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 25
  },
  {
    "id": "College Advanced Piano",
    "dept": "Performing Arts/Music",
    "code": "910",
    "title": "College Advanced Piano",
    "description": "This course will provide instruction and opportunities to perform for students who have already had several years of studying piano. Interested students will be able to register through Five Towns College and earn college credit.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 25
  },
  {
    "id": "College Music Theory",
    "dept": "Performing Arts/Music",
    "code": "911",
    "title": "College Music Theory",
    "description": "The theory class will discuss basics of music construction: key signatures, meter, intervals, major/minor scales and triads; musical form and analysis; inversions, 7th Chords, form and analysis, modes, cadences and four part writing. This class will prepare you for AP Music Theory. Interested students will be able to register through Five Towns College and earn college credit.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 25
  },
  {
    "id": "AP Music Theory",
    "dept": "Performing Arts/Music",
    "code": "913",
    "title": "AP Music Theory",
    "description": "The purpose of the AP Music Theory class is to prepare students in the area of music theory, analysis and ear training so they will be prepared for further study at the college level. In order for students to enroll in this course, they should have taken the prerequisite \"Music Theory\" course which is offered every year, or they need to take a placement exam to determine if they can be admitted to the course. *Students enrolled in the Music Theory AP course are required to take the Advanced Placement exam in May.",
    "credits": 1.0,
    "prerequisite": "Music Theory or by placement exam",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 26
  },
  {
    "id": "Concert Choir",
    "dept": "Performing Arts/Music",
    "code": "922",
    "title": "Concert Choir",
    "description": "Enrollment in Concert Choir is available for 9 -12 graders who love to sing. Students are expected to be able to blend in harmony, regulate their vocal volume, and follow along a musical score. Different styles of music will be performed including music theatre, classical, pop, opera, rock and jazz. Students in the choir are eligible to audition for the a cappella group, chamber choir, barbershop, and Broadway group. Choir students are eligible to audition for the All County and All State honor festivals. Choir meets five days a week and most students participate over the course of 4 years.",
    "credits": 1.0,
    "prerequisite": "No Prerequisite",
    "grade_levels": [
      "9",
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 26
  },
  {
    "id": "Symphonic Band",
    "dept": "Performing Arts/Music",
    "code": "932",
    "title": "Symphonic Band",
    "description": "Enrollment in the Symphonic Band is available to all woodwind, brass and percussion students in grades 9, 10, 11 and 12. All students must be registered into a performance class in order to participate in concerts, trips and to be eligible to participate in NYSBDA Honor Band, All-County, All-State and All-Eastern select ensembles. All members of the Symphonic Band perform at the Winter and Spring Concerts, Winter music assembly, Great Neck Memorial Day Parade, Graduation, and at other in school and outside performances. *Students in our Band and Orchestra program make up our Musical and Opera Pit Orchestra.",
    "credits": 1.0,
    "prerequisite": "registered in band last year or approval of the director by audition.",
    "grade_levels": [
      "9",
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 26
  },
  {
    "id": "String Orchestra",
    "dept": "Performing Arts/Music",
    "code": "935",
    "title": "String Orchestra",
    "description": "The String Orchestra consists of all 9th grade students plus students in grades 10, 11 and 12. The orchestra performs string repertoire that includes pop, jazz and classical. The string orchestra performs in the Winter and Spring Concerts as well as in the Winter Music Assembly and Music Fundraiser Concert. *Students in our Band and Orchestra program make up our Musical and Opera Pit Orchestra.",
    "credits": 1.0,
    "prerequisite": "Enrollment in a performance group in 8th and/or 9th grade or approval of the Director. An audition may be required.",
    "grade_levels": [
      "9",
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 26
  },
  {
    "id": "College Chamber Orchestra-Strings",
    "dept": "Performing Arts/Music",
    "code": "936",
    "title": "College Chamber Orchestra-Strings",
    "description": "Open to \"selected\" string students in grades 10, 11 and 12 or by audition with the recommendation from their music teacher and approval of the Department Head. This ensemble will rehearse and perform NYSSMA level 6 music from the standard string and symphony orchestral literature that includes overtures, symphonies, concertos, pops orchestra, musicals and opera. Chamber music groups will be formed for consideration in the Lincoln Center Chamber Music Competition. Students need to be playing on this level to be considered for participation. All students in the class will be required to perform at all chamber orchestra concerts and musical performances, which include Winter and Spring concerts, music fundraiser concert, opera, and musical. Interested students will be able to register through Five Towns College and earn college credit.",
    "credits": 1.0,
    "prerequisite": "Grades 10-12 only. Enrollment is based on selection or by audition. Approval required by Department Chair to register.",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 27
  },
  {
    "id": "College Wind Ensemble/Symphony Orchestra",
    "dept": "Performing Arts/Music",
    "code": "937",
    "title": "College Wind Ensemble/Symphony Orchestra",
    "description": "Open to “selected\" woodwind, brass and percussion students from symphonic band in grades 10, 11 or 12 by audition with the recommendation from their music teacher and approval of the Department Head. Students in the wind ensemble/symphony orchestra will rehearse period 2 and perform in both ensembles during the same class period as scheduled by the director. The music literature performed is equal to NYSSMA Level 6. All students in the class will be required to perform in all wind ensemble and symphony orchestra concerts and musical performances. Performances include: Winter & Spring Concerts, music assembly, Memorial Day Parade, Music Fundraiser Concert and Senior Concerto Night. Interested students will be able to register through Five Towns College and earn college credit.",
    "credits": 1.0,
    "prerequisite": "Grades 10-12. Enrollment is based on selection or by audition. Approval required by Department Chair to register.",
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 27
  },
  {
    "id": "COLLEGE ACTING, THEATRE GAMES & IMPROVISATION",
    "dept": "Performing Arts/Music",
    "code": "941",
    "title": "COLLEGE ACTING, THEATRE GAMES & IMPROVISATION",
    "description": "Students will learn acting technique, self-confidence, and self presentation skills through the use of drama activities including text based scene study, theater games, and improvisation. These exercises will allow one to develop their public speaking skills, stage presence, imagination, and concentration. Furthermore, the class will help with social skills as there is collaborative group work on a consistent basis. This is a fun and “up out of your seat” kind of class. *Students may take this course a second time only with teacher’s approval. Interested students will be able to register through Five Towns College and earn college credit.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "College",
    "repeatable": true,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 28
  },
  {
    "id": "Public Speaking",
    "dept": "Performing Arts/Music",
    "code": "942",
    "title": "Public Speaking",
    "description": "Time to overcome your fear! This course is designed to assist you in developing and understanding the skills and principles associated with speaking effectively in public. Not just a course on giving a speech, this class will explore the many genres in which we speak for power: storytelling, academic settings, poetry/drama, interviews, toasts, debate, and formal speeches. Emphasis is placed on encouraging an awareness of the power of rhetoric, the creativity involved in preparing for and using speech, and the manner in which voice, body, and awareness of audience contribute to the success of speaking.",
    "credits": 0.5,
    "prerequisite": "No prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 28
  },
  {
    "id": "DIRECTING WORKSHOP",
    "dept": "Performing Arts/Music",
    "code": "943",
    "title": "DIRECTING WORKSHOP",
    "description": "Students in this class will learn how to create living theatre out of the written script by assuming the directors' duties and responsibilities, which include (but are not limited to): analyzing the Text, developing a production concept, communicating with a production team, staging and blocking. Students will read a variety of texts and engage in dramatic activities to better understand the fundamental role of a stage director. Directing workshop is recommended for juniors and senior students who have taken one or more other drama classes. Please note, Directing Class is a prerequisite for students who are interested in directing a One-Act in their senior year.",
    "credits": 0.5,
    "prerequisite": "Approval of teacher",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 28
  },
  {
    "id": "Theatre Production",
    "dept": "Performing Arts/Music",
    "code": "0946",
    "title": "Theatre Production",
    "description": "In this course, students will put on a full theatrical production from beginning to end, which will be presented to district elementary schools. Students will have an opportunity to act in, direct, design and produce a play during the school day This class is perfect for students with an interest in any aspect of theatre, and welcomes both beginners and advanced students of all grades. Interested students will be able to register through Five Towns College and earn college credit.",
    "credits": 0.5,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 28
  },
  {
    "id": "Physical Education - Individual",
    "dept": "Physical Education",
    "code": "1401",
    "title": "Physical Education - Individual",
    "description": "This course will focus on developing students' knowledge of an competency in motor skills, movement patterns, and strategies essential to perform a variety of physical activities. These activities will include: Aerobics (step), Archery, Badminton (singles), Golf, Orienteering, Pickleball, Tennis, Table Tennis, Weight Training, Yoga, etc.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 29
  },
  {
    "id": "Physical Education - Team",
    "dept": "Physical Education",
    "code": "1405",
    "title": "Physical Education - Team",
    "description": "This course emphasizes team sports, introduction to lifetime activities and increasing overall fitness. This course covers the following activities: Running, Strength and Flexibility, Ultimate Frisbee, Soccer, Pillow Polo, Badminton (doubles), Lacrosse, Pickleball, Speedball, Volleyball, Softball, Basketball, etc.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [
      "9",
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 29
  },
  {
    "id": "Strength and Conditioning",
    "dept": "Physical Education",
    "code": "1426",
    "title": "Strength and Conditioning",
    "description": "This course will target the use of the weight room and focus on developing a solid foundation of strength, flexibility, agility, coordination and speed. Individual and whole body muscle adoption will take place in a progressive manner. Cardiovascular conditioning will include running, agility testing, rope skipping and step jumping.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [
      "9",
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 29
  },
  {
    "id": "Swimming for Fitness",
    "dept": "Physical Education",
    "code": "1428",
    "title": "Swimming for Fitness",
    "description": "This course will target the student wanting to increase their cardiovascular conditioning through swimming. Detailed instruction, with progression drills of freestyle; backstroke, breaststroke, butterfly and all elementary strokes will be covered. The student must have the ability to complete one lap of swimming non-stop with beginner form to be accepted into the class.",
    "credits": 0.5,
    "prerequisite": null,
    "grade_levels": [
      "9",
      "10",
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted Yes",
    "source_page": 29
  },
  {
    "id": "Earth Science Regents - The Physical Setting",
    "dept": "Science",
    "code": "0412",
    "title": "Earth Science Regents - The Physical Setting",
    "description": "An interdisciplinary laboratory-oriented course that builds upon the understanding of scientific concepts and mathematics acquired in the earlier grades. The course integrates major concepts in astronomy, geology, oceanography, meteorology and ecology with some attention given to advances in space science. The Earth Science Regents examination will be the final exam in this course. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 30
  },
  {
    "id": "Biology Regents ENL",
    "dept": "Science",
    "code": "418",
    "title": "Biology Regents ENL",
    "description": "This course is designed for students who are new to this country and who are concurrently enrolled in the ENL program. The course will follow the NYS Living Environment curriculum. Placement in the class will be offered to students on the basis of their English language skills as assessed by appropriate school personnel. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Ideally for ENL students Level 3",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 30
  },
  {
    "id": "Biology R – The Living Environment",
    "dept": "Science",
    "code": "421",
    "title": "Biology R – The Living Environment",
    "description": "A study of plant and animal characteristics, interactions, and physiology is the basis of this course. Emphasis is placed on living organisms and their interrelationships with the environment. Laboratory work is designed to further the spirit of science as inquiry. The Biology Regents examination will be the final exam for this course. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Regents Earth Science OR Departmental Approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 30
  },
  {
    "id": "Biology Honors",
    "dept": "Science",
    "code": "423",
    "title": "Biology Honors",
    "description": "An enriched and more quantitatively oriented course emphasizing the molecular, anatomical and ecological aspects of Biology. The course is designed for those students who are going to pursue careers in science, or qualified students who wish an intellectual challenge. All students will be expected to take the Biology Regents examination in June. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Earth Science students will be recommended for Honors Biology in the 9th grade when they meet the following requirements: a final course average of 93% or higher and teacher recommendation.",
    "grade_levels": [
      "9"
    ],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 31
  },
  {
    "id": "AP Biology",
    "dept": "Science",
    "code": "425",
    "title": "AP Biology",
    "description": "AP Biology is an introductory college-level biology course. Students cultivate their understanding of biology through inquiry-based investigations as they explore the following topics: evolution, cellular processes, energy and communication, genetics, information transfer, ecology, and interactions. The AP Biology course is equivalent to a two-semester college introductory biology course for biology majors. This course requires that 25 percent of the instructional time will be spent in hands-on laboratory work, with an emphasis on inquiry-based investigations that provide students with opportunities to apply the science practices. Students should have successfully completed high school courses in biology and chemistry. In May, the students will take the College Board Advanced Placement Test in Biology. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Biology Regents Course Average = 92% OR Biology Honors Course Average = 88%; Living Environment Regents Score must be above a 90% AND Chemistry Regents Course Average = 92% OR Chemistry Honors Course Average = 88%; Chemistry Regents Score must be above a 90%",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Departmental Approval Required. Student Requests Accepted No",
    "source_page": 31
  },
  {
    "id": "Inquiry Through Chemistry",
    "dept": "Science",
    "code": "0429",
    "title": "Inquiry Through Chemistry",
    "description": "This course will provide students with an overview of general chemistry and scientific inquiry. Students will gain an understanding of atomic concepts, the periodic table, chemical bonding, stoichiometry, the physical and chemical properties of matter, acids, bases and more. This course will involve many hands-on lab activities, experiments, and virtual activities that will further knowledge, understanding of chemistry, and problem-solving techniques. In addition, this course will emphasize a discovery approach in which the student will learn to interpret laboratory observations in the manner of a real world scientist. Students will understand and apply scientific concepts, principles, and theories pertaining to chemistry and recognize the historical development of ideas in science and their real-world connections. *This course does not end in a Regents examination.",
    "credits": 1.0,
    "prerequisite": "Biology Regents-The Living Environment",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 31
  },
  {
    "id": "Chemistry R",
    "dept": "Science",
    "code": "431",
    "title": "Chemistry R",
    "description": "A standard high school course, which emphasizes the relationship of matter and energy in our world and universe. The ideas that have influenced the manner in which science has evolved and how these ideas have influenced the humanistic and technological development of society are also emphasized. Laboratory work in small groups uses a \"hands on\" approach and serves to illustrate and reinforce basic concepts and relationships. The Chemistry Regents examination will be the final exam for this course. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Biology course average 75",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 32
  },
  {
    "id": "Chemistry Honors",
    "dept": "Science",
    "code": "433",
    "title": "Chemistry Honors",
    "description": "An enriched and more quantitatively oriented course emphasizing the same areas as Regents Chemistry. Mathematical rigor is maintained throughout the course. The course is designed for students who wish to pursue careers in science as well as for those students who wish an intellectual challenge. All students will be expected to take the Chemistry Regents examination in June. The selection and invitation of students to participate in our Honors offerings, begins with teacher recommendation. The department, along with guidance will review each candidate with regard to appropriate criteria. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Biology Regents Exam Average = 95 OR Biology Honors Exam Average = 88; Living Environment Regents = 93 Algebra Course Average = 95 OR Geometry Course Average = 85",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 32
  },
  {
    "id": "AP Chemistry",
    "dept": "Science",
    "code": "435",
    "title": "AP Chemistry",
    "description": "The AP Chemistry course provides students with a college-level foundation to support future advanced coursework in chemistry. Students develop their understanding of chemistry through inquiry-based investigations, as they explore content such as: atomic structure, intermolecular forces and bonding, chemical reactions, kinetics, thermodynamics, and equilibrium. The AP Chemistry course is designed to be the equivalent of the general chemistry course usually taken during the first college year. Students should have successfully completed a general high school chemistry course and Algebra II. This course requires that 25 percent of the instructional time will be spent in hands-on laboratory work, with an emphasis on inquiry-based investigations that provide students with opportunities to apply the science practices. This class meets daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Biology Honors Course Average = 90; Chemistry Honors EXAM average = 88 Regents Chemistry/Physics students Course Average = 95; Algebra 2 completed AND Course Average = 90",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Departmental Approval Required. Student Requests Accepted No",
    "source_page": 32
  },
  {
    "id": "Physics R – The Physical Setting",
    "dept": "Science",
    "code": "441",
    "title": "Physics R – The Physical Setting",
    "description": "A challenging high school course dealing with the study of the basic ideas and relationships of space, mass and time, and how the scientific investigation of these ideas over the past centuries has increased our understanding of the universe. Topics include motion, forces, momentum, work and energy, heat, sound, light, electricity and magnetism. Laboratory work to illustrate and reinforce these concepts will be carried out in small groups. The Physics Regents examination will be the final exam for this course. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Biology/Living Environment Completed; Chemistry Regents Course Average 80; Inquiry Chem Exam must be > 90; recommended = 95 Algebra 2/Trig (Completed/concurrent)",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 33
  },
  {
    "id": "AP Physics 1",
    "dept": "Science",
    "code": "443",
    "title": "AP Physics 1",
    "description": "AP Physics 1 is a course designed to explore and understand the mechanisms that govern the world around you: the how and why of many everyday interactions. It provides the foundation for the study of engineering and is an integral part of developments in all STEM fields. Physics is a place for those who enjoy learning about, analyzing and solving problems. The course will explore many phenomena such as how missiles arrive at their intendent target, why rollercoasters feel so extreme, and how satellites are placed into orbit. The course focuses on conceptual understanding and provides the opportunity to solve many everyday problems through rigorous mathematical analysis requiring certain prerequisites for course enrollment (see below). The course follows the guidelines and requirements set forth by the College Board and will provide opportunities for numerous hands-on inquiry-based laboratory explorations as it delves through the science practices established by College Board. The AP Physics 1 course is equivalent to the first sequence in a college level physics program and focuses on all of the basic topics in a Mechanics and Fluid Mechanics course (the additional sequences can be followed up on in second year courses AP Physics 2 or AP Physics C and as such is a recommended Junior year course elective).",
    "credits": 1.0,
    "prerequisite": "Chemistry Honors EXAM Average = 88 OR Chem R EXAM Average = 95 OR Regents Physics EXAM Average 92; Algebra 2/Trig completed (Course Average = 88) AND Pre-Calculus concurrent",
    "grade_levels": [
      "11"
    ],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Department Approval Required. Student Requests Accepted No",
    "source_page": 33
  },
  {
    "id": "AP Physics 2",
    "dept": "Science",
    "code": "0445",
    "title": "AP Physics 2",
    "description": "AP Physics 2 is a continuation and completion of the college level physics sequence started in AP Physics 1 and is equivalent to more than a second semester of college level algebra-based Physics study. Similar to AP Physics 1 (see course description), the course will focus on the mechanisms that govern the everyday world around us and delve deeper into the interactions on microscopic, atomic and subatomic levels. From how earthquakes can bring down buildings, why the sky is blue, and how magnets power electric vehicles, to how nuclear submarines gain propulsion through the destruction of matter, the course covers a broad range of modern technological advances. Similar to AP Physics 1, the course follows the guidelines and requirements set forth by the College Board and will provide opportunities for numerous hands-on inquiry-based laboratory explorations as it delves through the science practices established by College Board. The AP Physics 2 course completes the typical sequences in the study of college level Physics and students will leave with full exposure to all areas in the field of Physics applicable to engineering, premedical studies, and most STEM fields.",
    "credits": 1.0,
    "prerequisite": "Successful completion of AP Physics 1; Pre-Calculus concurrent",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Department Approval Required. Student Requests Accepted No",
    "source_page": 34
  },
  {
    "id": "AP Physics C",
    "dept": "Science",
    "code": "447",
    "title": "AP Physics C",
    "description": "At the first-year college level for students of science or engineering, this course encompasses areas of greater complexity and difficulty than encountered in the AP Physics 1 & 2 curriculum. A major emphasis of the course will rely on the students' mathematics background. Laboratory work in advanced topics will be part of the course, as well as a preparation for the College Board Advanced Placement Test in Physics \"C\", which all students are expected to take. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "AP Physics 1 Average = 90; Calculus AB completed/concurrent Math grade required = 85",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Department Approval Required. Student Requests Accepted No",
    "source_page": 34
  },
  {
    "id": "Forensics",
    "dept": "Science",
    "code": "451",
    "title": "Forensics",
    "description": "This course explains the science used in forensic science techniques and encompasses many subject areas, including Biology, Earth Science, Chemistry, Physics, Psychology and Math. Students will learn about different types of evidence and the techniques used to collect and analyze it. Students will use their techniques to investigate crime scenes and solve crimes through the collection, handling and examination of trace evidence. Evidence may include hair, fibers, soil, pollen, glass, fingerprint, blood, blood spatter, DNA, drug, handwriting, tool mark analysis, impressions, ballistics, forensic anthropology and other such evidence to determine cause and time of death. Students will have to solve a series of scenarios taken from popular media, historic cases, as well as, newly created cases where they will use their newly learned forensic science skills. This course will involve hands-on lab activities, experiments, and virtual activities that will further knowledge and understanding of forensic science and problem-solving techniques.",
    "credits": 1.0,
    "prerequisite": "Successful completion of Inquiry Chem, Marine Science or Regents Chem/Physics",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 35
  },
  {
    "id": "AP Environmental Science",
    "dept": "Science",
    "code": "0453",
    "title": "AP Environmental Science",
    "description": "The AP Environmental Science course is designed to engage students with the scientific principles, concepts, and methodologies required to understand the interrelationships within the natural world. The course requires that students identify and analyze natural and human made environmental problems, evaluate the relative risks associated with these problems, and examine alternative solutions for resolving or preventing them. Environmental science is interdisciplinary, embracing topics from geology, biology, environmental studies, environmental science, chemistry, and geography. The AP Environmental Science course is designed to be the equivalent of a one semester, introductory college course in environmental science. Although there are no specific AP Environmental Science labs or field investigations required for the course, it is required that students have the opportunity to spend a minimum of 25% of instructional time engaged in hands-on, inquiry-based laboratory and/or fieldwork investigations. This class meets daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Required that students have passed the Regents sequence of Earth Science, Biology and Chemistry",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Departmental Approval Required. Student Requests Accepted No",
    "source_page": 35
  },
  {
    "id": "Marine Science",
    "dept": "Science",
    "code": "456",
    "title": "Marine Science",
    "description": "This course will explore the major factors that affect aquatic and marine life. Its interdisciplinary nature will place strong emphasis on laboratory work and aquaria set-ups and maintenance. Special emphasis will be given to the marine environment. The chemistry, physics, and biology of water and ecosystems are thoroughly investigated. Students will work with aquaria designs to gain experience in breeding, behavioral or environmental studies. This course is ideally for 11th graders not taking Regents Physics. Class daily plus lab alternate days.",
    "credits": 1.0,
    "prerequisite": "Successful completion of Inquiry Chemistry or Chemistry",
    "grade_levels": [
      "11"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 35
  },
  {
    "id": "Anatomy & Physiology",
    "dept": "Science",
    "code": "0458",
    "title": "Anatomy & Physiology",
    "description": "This course provides detailed study of the anatomy and physiology of human organ systems. It is intended primarily for students interested in medicine, dentistry, physical therapy, sports medicine, chiropractic and osteopathic medicine but is also appropriate for students who wish to gain a better understanding of their own physical body. Material concerning the clinical aspects of body structure and function will be included. Dissections and virtual dissections will highlight the various aspects of anatomy. There will also be comparisons made between homeostasis and pathophysiology. Memorization is a key skill to succeed in this course as tests, along with projects, will be used to assess student learning. This course elective is only available to 11th and 12th grade students.",
    "credits": 1.0,
    "prerequisite": "Regents/Honors Biology Grade AND Regents/Honors Chemistry Recommended to be = 85%",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 36
  },
  {
    "id": "Astronomy",
    "dept": "Science",
    "code": "0459",
    "title": "Astronomy",
    "description": "A laboratory course covering the earth, solar system, properties of stars, spectral classification, stellar evolution, variable stars, interstellar space and cosmology. There will be a commitment of two-night observations using our school observatory and a project dealing with some aspect of astronomy. This course elective is only available to 11th and 12th grade students.",
    "credits": 1.0,
    "prerequisite": "Earth Science",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "1 unit of credit or 1/2 unit of credit. Student Requests Accepted Yes",
    "source_page": 36
  },
  {
    "id": "Research Methods",
    "dept": "Science",
    "code": "461",
    "title": "Research Methods",
    "description": "This course is designed to meet the needs of students who plan to pursue a research project in the social sciences, mathematics or physical and life sciences. Designed as an introduction to research as a process, this course will emphasize the appropriate on and off-line search avenues, experimental design, measurement and analysis of data and presentation techniques. Students who are interested must obtain and complete an application to be considered for admission. Complete applications are to be handed in to the Science Department Head on or before the specified deadline date.",
    "credits": 1.0,
    "prerequisite": "Recommendation by Department Application Required",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 36
  },
  {
    "id": "Science Research Honors",
    "dept": "Science",
    "code": "462",
    "title": "Science Research Honors",
    "description": "This course is designed for the student with special scientific interest. It will deal with all aspects of research and will help the student to create, develop, and produce short term and long-range experiments. Students electing the course will be prepared to enter competitions such as the Long Island Science Congress and the WAC Research Association Invitational.",
    "credits": 1.0,
    "prerequisite": "Research Methods = 88 Any Science Class = 85 Class Average OR Departmental Approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 36
  },
  {
    "id": "Senior Research Seminar Honors",
    "dept": "Science",
    "code": "463",
    "title": "Senior Research Seminar Honors",
    "description": "This seminar will enable all research students to polish their papers, receive support in their editing efforts, and prepare all entry materials for a variety of competitions. Research students from the social sciences, mathematics and science department will gather in an informal setting to obtain help, brainstorm with other students and complete all components required for competition.",
    "credits": 1.0,
    "prerequisite": "Research Methods, Science Research Honors, Summer Research OR Departmental Approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 36
  },
  {
    "id": "Global History and Geography 9",
    "dept": "Social Studies",
    "code": "0202",
    "title": "Global History and Geography 9",
    "description": "Global History and Geography is a two-year course. Beginning with the birth of civilization and continuing with a cross-cultural, chronological journey through the ages, this course challenges students to examine life before 1750 CE. Primary and secondary sources will be utilized to develop critical thinking and writing skills. The final is a school-generated exam.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [
      "9"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 37
  },
  {
    "id": "Human Geography - Advanced Placement",
    "dept": "Social Studies",
    "code": "0208",
    "title": "Human Geography - Advanced Placement",
    "description": "The AP Human Geography course is equivalent to an introductory college-level course in human geography. The course introduces students to the systematic study of patterns and processes that have shaped human understanding, use, and alteration of Earth’s surface. Students employ spatial concepts and landscape analysis to examine socioeconomic organization and its environmental consequences. They also learn about the methods and tools geographers use in their research and applications. This course is designed for students who have high academic standing and exhibit strong oratory, reading, writing and comprehension skills. Students are required to take the College Board Advanced Placement examination Human Geography in May.",
    "credits": 1.0,
    "prerequisite": "Students must have an average 95 or higher in Social Studies 8 and approval of the Social Studies Department.",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 37
  },
  {
    "id": "Global History and Geography 9/10 ENL",
    "dept": "Social Studies",
    "code": "0214",
    "title": "Global History and Geography 9/10 ENL",
    "description": "This course is designed for students who are concurrently enrolled in the ENL program. The course follows a Global History and Geography curriculum and stresses basic social studies skills and concepts, as well as practice in verbal and written English for newer English Language Learners. Placement in the class will be offered to students on the basis of their English language skills as assessed by appropriate school personnel.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [
      "9",
      "10"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 37
  },
  {
    "id": "Global History and Geography Regents ENL 10",
    "dept": "Social Studies",
    "code": "215",
    "title": "Global History and Geography Regents ENL 10",
    "description": "This course is designed for students who are concurrently enrolled in the ENL program. The course will follow a Global History and Geography curriculum and will stress basic social studies skills and concepts, as well as practice in verbal and written English. Placement in the class will be offered to students on the basis of their English language skills as assessed by appropriate school personnel.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [
      "10"
    ],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 37
  },
  {
    "id": "Global History and Geography10R",
    "dept": "Social Studies",
    "code": "223",
    "title": "Global History and Geography10R",
    "description": "This is part two of the Global History and Geography curriculum. Students are challenged with a chronological approach to examining the world from approximately 1750 to the present-day. Emphasis will be given to analyzing primary source documents, synthesizing information, and sharpening writing skills.",
    "credits": 1.0,
    "prerequisite": "Social Studies 9",
    "grade_levels": [
      "10"
    ],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 37
  },
  {
    "id": "World History - Advanced Placement",
    "dept": "Social Studies",
    "code": "224",
    "title": "World History - Advanced Placement",
    "description": "Advanced Placement in World History is intended for students with strong interest and demonstrated ability in social studies. Students will be expected and encouraged to analyze historical events and evidence worldwide and develop critical writing skills. The course offers a global perspective on Asia, Africa, the Americas, and Europe. Among the themes covered are: world religions, comparative labor systems, the changing role of women, comparative revolution and decolonization. Students will be encouraged to make connections across regions to gain historical perspective. Students are required to take the College Board Advanced Placement Examination in World History in May and the Regents in Global History and Geography in June. A high level of achievement in English 9 and 9th Grade Social Studies is strongly recommended.",
    "credits": 1.0,
    "prerequisite": "An \"A\" in Global 9 and/or AP Human Geography and approval of the Social Studies Dept.",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 38
  },
  {
    "id": "United States History - Advanced Placement",
    "dept": "Social Studies",
    "code": "232",
    "title": "United States History - Advanced Placement",
    "description": "The Advanced Placement course in American History is designed for those students who have demonstrated superior ability and interest in the social studies. This course will include reading the works of outstanding historians, close examination of documents, and emphasis on historiography, and on the development of a critical approach to reading and writing. The members of the class are expected to take both the College Board Advanced Placement Examination in United States History and the United States History Regents Examination. A high level of achievement in English is strongly recommended.",
    "credits": 1.0,
    "prerequisite": "An \"A\" in Social Studies 10 or AP World History and approval of the Social Studies Department",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 38
  },
  {
    "id": "United States History and Government 11R",
    "dept": "Social Studies",
    "code": "233",
    "title": "United States History and Government 11R",
    "description": "This is a course designed to fulfill the New York State requirement. Among the topics included are the U.S. Constitution, geography, industrialization and urbanization, immigration, war, prosperity, depression, global crisis: responsibility and cooperation. Critical thinking and writing skills will be enhanced. Analysis and evaluation of primary source material as well as scholarly secondary sources will be emphasized. Responding to document based questions and thematic essay writing skills will be further refined. All students will take the U.S. History and Government Regents exam in June.",
    "credits": 1.0,
    "prerequisite": "Social Studies 10",
    "grade_levels": [
      "11"
    ],
    "ap_flag": false,
    "level": "Regents",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 38
  },
  {
    "id": "United States History and Government ENL",
    "dept": "Social Studies",
    "code": "234",
    "title": "United States History and Government ENL",
    "description": "This course is designed for students who are concurrently enrolled in the ENL program. The course will follow a United States History and Government curriculum and will stress basic social studies skills and concepts, as well as practice in verbal and written English. Placement in the class will be offered to students on the basis of their English language skills as assessed by appropriate school personnel. All students will take the U.S. History and Government Regents exam in June.",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 38
  },
  {
    "id": "Economics in American Life",
    "dept": "Social Studies",
    "code": "250",
    "title": "Economics in American Life",
    "description": "This is an issue-oriented and problem-solving approach to the study of contemporary American economics. The first part of the course deals with the basic laws of the free-market economy, the family as a consuming unit, as well as the organization, operation, and regulation of American business and labor. The second part of the course deals with \"macro economics\" emphasizing the role of government (local, state, and national), comparisons between American capitalism and other economic systems, and problems of international trade and foreign aid.",
    "credits": 0.5,
    "prerequisite": "Social Studies 11",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "NOTE: Course 250 Economics must be selected if students elect to satisfy the twelfth year Social Studies requirement with two semester courses. Student Requests Accepted No",
    "source_page": 39
  },
  {
    "id": "Civics and Social Issues",
    "dept": "Social Studies",
    "code": "252",
    "title": "Civics and Social Issues",
    "description": "This course is designed to provide students with practical knowledge and understanding of the American political system. Throughout the semester students will: Explore the responsibilities of good citizenship and social engagement; Critically examine the social and political issues that currently face our society; Examine Supreme Court cases that have a direct impact on their lives. This is a one semester course open to 12th grade students. This course can satisfy the senior government requirement.",
    "credits": 0.5,
    "prerequisite": "Social Studies 11",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 39
  },
  {
    "id": "Macroeconomics & Microeconomics-Advanced Placement",
    "dept": "Social Studies",
    "code": "264",
    "title": "Macroeconomics & Microeconomics-Advanced Placement",
    "description": "The AP Economics course is a college level course designed for those students who have demonstrated exceptional scholarship in social studies. The course will focus on three major topics: Basic Economic Concepts (scarcity, the market process, supply and demand), Macroeconomics (measurement of the national economy, determination of national income, money and banking and international trade), and Microeconomics (elasticity, marginal utility and analysis of costs). Students will discuss concepts in relation to current economic problems and will analyze the role of the American Government in the economic process. In May students will take both Microeconomics and Macroeconomics AP examinations.",
    "credits": 1.0,
    "prerequisite": "An \"A\" in US History and approval of the Social Studies Department",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 39
  },
  {
    "id": "Macroeconomics - Advanced Placement",
    "dept": "Social Studies",
    "code": "0265",
    "title": "Macroeconomics - Advanced Placement",
    "description": "AP Macroeconomics is a college-level course that introduces students to the principles that apply to an economic system as a whole. The course places particular emphasis on the study of national income and price-level determination. It also develops students’ familiarity with economic performance measures, the financial sector, stabilization policies, economic growth, and international economics. Students learn to use graphs, charts, and data to analyze, describe, and explain economic concepts. College Course Equivalent AP Macroeconomics is equivalent to a one-semester introductory college course in economics. Students are required to take the AP Examination in Macroeconomics in May.",
    "credits": 1.0,
    "prerequisite": "Social Studies 11 and approval of the Social Studies Department",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 40
  },
  {
    "id": "US Government and Politics - Advanced Placement",
    "dept": "Social Studies",
    "code": "266",
    "title": "US Government and Politics - Advanced Placement",
    "description": "Advanced Placement U.S. Government and Politics is a college level course. This is a reading-intensive, discussion oriented course. Students will be expected and encouraged to develop their research and writing skills. This course is designed for students who have an interest in, or are seeking to increase their knowledge and understanding of: Constitutional foundations, institutions of national government, the impact of the media on national politics, civil rights and civil liberties, interest groups, political beliefs and behaviors, and politics of public policy. Students are required to take the Advanced Placement examination in May. A high level of achievement in English is strongly recommended.",
    "credits": 1.0,
    "prerequisite": "An \"A\" in US History and approvalof the Social Studies Department",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 40
  },
  {
    "id": "European History - Advanced Placement",
    "dept": "Social Studies",
    "code": "267",
    "title": "European History - Advanced Placement",
    "description": "In AP European History, students investigate significant events, individuals, developments, and processes from approximately 1450 to the present. Students develop and use the same skills, practices, and methods employed by historians: analyzing primary and secondary sources; developing historical arguments; making historical connections; and utilizing reasoning about comparison, causation, and continuity and change over time. The course also provides seven themes that students explore throughout the course in order to make connections among historical developments in different times and places. Students registered in this course are required to take the Advanced Placement European History College Board examination in May. Please note that this course does not satisfy the social studies graduation requirement for either grade 11 or 12.",
    "credits": 1.0,
    "prerequisite": "Social Studies 10 and approval of the Social Studies Department",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 41
  },
  {
    "id": "Facing History SOCIAL STUDIES",
    "dept": "Social Studies",
    "code": "269",
    "title": "Facing History SOCIAL STUDIES",
    "description": "Facing History is a unique program for students who want to make a difference in our school, local, and global communities. This course is designed to increase tolerance and multicultural understanding through literature, history, psychology, service learning, and research. It is co-taught by a team of teachers from the English, Social Studies, Library and Internship departments. This program satisfies the English and Social Studies requirements for senior year as well as an elective credit. Second semester includes an off-site service-based internship that provides an opportunity for civic engagement to promote upstander behavior. The Social Studies component of this program explores both historical and modern day examples of injustice, bigotry and intolerance. The curriculum will explore not only the occurrences of such actions but also delve into the psychology behind the behaviors in order to better understand events such as Rwanda, Armenia, the Holocaust, Japanese Internment and the American Eugenics Movement. Students will engage in classroom simulations, debates, and current events analysis. Additionally, students will also participate in service projects. *This course meets the Social Studies requirement for the NCAA eligibility.",
    "credits": 1.0,
    "prerequisite": "SENIORS ONLY. Application required. Interview and teacher approval.",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Corequisite: Enrollment in Facing History Social Studies, Facing History Research and Facing History Internship. Student Requests Accepted No",
    "source_page": 41
  },
  {
    "id": "Facing History Internship",
    "dept": "Social Studies",
    "code": "270",
    "title": "Facing History Internship",
    "description": "Facing History is a unique program for students who want to make a difference in our school, local, and global communities. This course is designed to increase tolerance and multicultural understanding through literature, history, psychology, service learning, and research. It is co-taught by a team of teachers from the English, Social Studies, Library and Internship departments. This program satisfies the English and Social Studies requirements for senior year as well as an elective credit. Second semester includes an off-site service-based internship that provides an opportunity for civic engagement to promote upstander behavior. For the Internship portion of this program students prepare resumes, cover letters, and explore internship options during the 1st semester. Students work with the program coordinator to select an appropriate placement for the second semester. Students will then participate in an off-site community service based internship where they put many of the themes they have learned into action.",
    "credits": 1.0,
    "prerequisite": "SENIORS ONLY.",
    "grade_levels": [
      "12"
    ],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Corequisite: Enrollment in Facing History Social Studies, Facing History Leadership & Media Studies and Facing History Internship. Student Requests Accepted No",
    "source_page": 42
  },
  {
    "id": "Psychology - Advanced Placement",
    "dept": "Social Studies",
    "code": "280",
    "title": "Psychology - Advanced Placement",
    "description": "The purpose of the Advanced Placement course in Psychology is to introduce juniors and seniors to the systematic and scientific study of behavior and the mental processes of human beings and other animals. Students are exposed to the psychological facts principles, and phenomena associated with each of the major subfields within psychology, such as: Abnormal, Neuro Science, Clinical, Developmental, Learning, Memory, Social Psychology and Personality Theories. A high level of achievement in English is strongly recommended. Please note that this course does not satisfy the Social Studies requirement for either grade 11 or grade 12.",
    "credits": 1.0,
    "prerequisite": "Minimum of B in Biology. Approval of Social Studies Department",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 42
  },
  {
    "id": "Learning Strategies",
    "dept": "Study Skills",
    "code": "1332 - 1337",
    "title": "Learning Strategies",
    "description": "This course is designed to give students academic support in all subjects, while developing general study skills. Study Center teachers work cooperatively with subject area teachers to supplement and enhance classroom instruction. This course will give students structure and direction to master any course of study. This course is available on a daily or alternate day basis for half the year or all year long.",
    "credits": 0.0,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "No Credit. Student Requests Accepted Yes",
    "source_page": 43
  },
  {
    "id": "Latin 9 H",
    "dept": "World Languages",
    "code": "512",
    "title": "Latin 9 H",
    "description": "Latin structures, vocabulary, and English derivations are further developed. A greater emphasis is put on translation skills. Proficiency Level Novice High to Intermediate Low",
    "credits": 1.0,
    "prerequisite": "Latin 8",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 44
  },
  {
    "id": "Latin 10 H",
    "dept": "World Languages",
    "code": "513",
    "title": "Latin 10 H",
    "description": "Emphasis is given to Roman literature and students read various selections from great authors. Since Cicero is the main author, students also learn about Roman law and courtroom practice. Throughout the year, there is an intensive review of grammar. The FLACS Checkpoint B Exam is taken at the end of the course. Proficiency Level Novice High to Intermediate Low",
    "credits": 1.0,
    "prerequisite": "Latin 9 H",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 44
  },
  {
    "id": "Latin Literature Honors",
    "dept": "World Languages",
    "code": "516",
    "title": "Latin Literature Honors",
    "description": "This is a course in Latin literature. Students are required to translate selections from Latin authors and to write interpretive essays on these works. Quarter one covers the poems of Catullus. Quarter two is given over to selections from the Odes of Horace and the Metamorphoses of Ovid. Third quarter is devoted to prose: selections from the works of the Roman historians, Livy, Sallust, and Tacitus. Quarter four returns to Catullus when students translate a long selection from his poem 64. This course will be offered alternately with AP Latin. Proficiency Intermediate Low to Intermediate Mid",
    "credits": 1.0,
    "prerequisite": "Latin 10, FLACS Checkpoint B Exam, and departmental approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 44
  },
  {
    "id": "AP Latin",
    "dept": "World Languages",
    "code": "517",
    "title": "AP Latin",
    "description": "This course prepares students for the Latin AP exam. Students read in English selections from Caesar's Gallic War and the entire Aeneid of Vergil; they translate long selected passages from Caesar and Vergil and write essays on those passages. Proficiency Level Intermediate Low to Intermediate Mid",
    "credits": 1.0,
    "prerequisite": "Latin 10, FLACS Checkpoint B Exam and departmental approval",
    "grade_levels": [],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 44
  },
  {
    "id": "French 9 H",
    "dept": "World Languages",
    "code": "541",
    "title": "French 9 H",
    "description": "This is an accelerated course in which more advanced reading, writing, listening and Speaking are introduced. The course is organized thematically integrating authentic French culture from all of the French speaking countries. Students will engage in the three language modes: Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "French 8",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 44
  },
  {
    "id": "French 10 H",
    "dept": "World Languages",
    "code": "542",
    "title": "French 10 H",
    "description": "In the practice of the four skills (understanding, speaking, reading, and writing). The course is organized thematically integrating authentic French culture from all of the French speaking countries. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The FLACS Checkpoint B Exam is taken at the end of the course. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "French 9 H",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 45
  },
  {
    "id": "French 11 Honors (pre AP)",
    "dept": "World Languages",
    "code": "543",
    "title": "French 11 Honors (pre AP)",
    "description": "This checkpoint C level class is a preparation for the French Language and Culture course in grade 12. In this pre-AP class, students will continue to develop their advanced skills in the formal and informal French language. Students will read fiction and nonfiction texts, engage in speaking, writing tasks and continue to develop their listening comprehension skills at an advanced level. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "French 10 Honors with a grade of 90 or better and a grade of 90 or better on the FLACS Checkpoint B Exam",
    "grade_levels": [
      "11"
    ],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 45
  },
  {
    "id": "AP French 12",
    "dept": "World Languages",
    "code": "544",
    "title": "AP French 12",
    "description": "This course develops a high degree of proficiency in the language. Conversational ability is channeled toward extended discourse, comprehension of texts of a wide variety of topics, and competent reaction orally and in writing to materials presented for listening and reading. Course content is drawn from broad areas of interest. Thus, the students can pursue their intellectual interests while perfecting their language skills. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. In May, those enrolled as AP French 12 are expected to take the College Board AP Examination in French. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "French 11 Honors",
    "grade_levels": [
      "12"
    ],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 45
  },
  {
    "id": "Spanish I",
    "dept": "World Languages",
    "code": "551",
    "title": "Spanish I",
    "description": "This course follows Spanish I at South Middle School. An introduction to the four skills of listening, speaking, reading, and writing. Easy conversations on topics of everyday interest are developed. Students learn to appreciate the cultural aspects of Hispanic life in Europe, Latin America, and the United States. Course is for newcomers or students previously exempt from World Languages on their IEP. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Novice Low",
    "credits": 1.0,
    "prerequisite": "No Prerequisite",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 45
  },
  {
    "id": "Spanish II",
    "dept": "World Languages",
    "code": "552",
    "title": "Spanish II",
    "description": "Communicative competency and proficiency in speaking, listening, reading and writing is further developed. Conversations are expanded both as to themes and sophistication. Appreciation and understanding of the cultural aspects of Hispanic life are pursued in greater depth. This Spanish class uses comprehension based methods of language instruction. Spanish language and culture are taught simultaneously in order for students to develop cultural understanding while building proficiency. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Novice Mid to High",
    "credits": 1.0,
    "prerequisite": null,
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 46
  },
  {
    "id": "Spanish III",
    "dept": "World Languages",
    "code": "553",
    "title": "Spanish III",
    "description": "The practice of skills is continued in all of the skill areas. The curriculum follows the NYSED thematic topics. Authentic texts, videos, and podcasts are used to familiarize students with modern life in Spanish speaking countries. This Spanish class uses comprehension based methods of language instruction. Spanish language and culture are taught simultaneously in order for students to develop cultural understanding while building proficiency. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "Spanish 8 or Spanish II",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 46
  },
  {
    "id": "Spanish IV",
    "dept": "World Languages",
    "code": "554",
    "title": "Spanish IV",
    "description": "The course consists of thematic units selected according to the New York State syllabus. They serve to increase conversational abilities, and the ability to write and to read. The FLACS Checkpoint B Exam is taken at the end of the course. This Spanish class uses comprehension based methods of language instruction. Spanish language and culture are taught simultaneously in order for students to develop cultural understanding while building proficiency. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "Spanish III",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 46
  },
  {
    "id": "College Spanish Conversation",
    "dept": "World Languages",
    "code": "557",
    "title": "College Spanish Conversation",
    "description": "Juniors or Seniors will have the opportunity to expand their communication skills in this post Flacs B class that emphasizes communicative competencies. Please note that students not pursuing the AP program may register for this course. Students have the option to earn college credit through a local university. . Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "Spanish IV or Spanish 10 Honors",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 46
  },
  {
    "id": "College Spanish Portfolio",
    "dept": "World Languages",
    "code": "558",
    "title": "College Spanish Portfolio",
    "description": "This is a junior or senior elective for those students who would like to practice and enhance their communication skills. Students will be expected to collaborate on a series of projects and present an end of year portfolio. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. Please note that students not pursuing the AP program may register for this course. Students have the option to earn college credit through a local university. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "Spanish Conversation or Spanish 11 Honors",
    "grade_levels": [
      "11",
      "12"
    ],
    "ap_flag": false,
    "level": "College",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 47
  },
  {
    "id": "Spanish 9 H",
    "dept": "World Languages",
    "code": "561",
    "title": "Spanish 9 H",
    "description": "Conversational ability and communicative competency continue to be stressed. More advanced reading and writing is introduced. This begins a rapidly paced and rigorous study of thematic vocabulary intertwined with grammar and structure topics. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "Course grade of 90 or better in Spanish 8 and 90 or better.",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 47
  },
  {
    "id": "Spanish 10 H",
    "dept": "World Languages",
    "code": "562",
    "title": "Spanish 10 H",
    "description": "In the practice of the four skills (listening, speaking, reading, and writing) students are directed toward increasing self-expression. Authentic reading materials are emphasized. The FLACS Checkpoint B Exam is taken at the end of the course. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "Spanish 9 Honors",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 47
  },
  {
    "id": "Spanish 11 Honors (pre AP)",
    "dept": "World Languages",
    "code": "563",
    "title": "Spanish 11 Honors (pre AP)",
    "description": "This checkpoint C level class is a preparation for the Spanish Language and Culture course in grade 12. In this pre-AP class, students will continue to develop their advanced skills in the formal and informal Spanish language. Students will read fiction and nonfiction texts, engage in speaking, writing tasks and continue to develop their listening comprehension skills at an advanced level. Students will engage in the three language modes: Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "Spanish 10 Honors with a grade of 90 or better and a grade of 90 or better on the FLACS Checkpoint B Exam",
    "grade_levels": [
      "11"
    ],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 47
  },
  {
    "id": "AP Spanish 12",
    "dept": "World Languages",
    "code": "565",
    "title": "AP Spanish 12",
    "description": "The course develops a high degree of proficiency in the language. Conversational ability is directed toward extended discourse, comprehension of texts on a wide variety of topics, and competent reaction orally and in writing to materials presented for listening and reading. Course content is drawn from broad thematic topics. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. In May, those enrolled as 12AP are expected to take the College Board AP Examination in Spanish. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "Spanish 11 Honors and departmental approval",
    "grade_levels": [
      "12"
    ],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 48
  },
  {
    "id": "Mandarin Chinese 9 H",
    "dept": "World Languages",
    "code": "573",
    "title": "Mandarin Chinese 9 H",
    "description": "This sequel to Chinese 8 is a course in which more advanced speaking, listening, reading and writing skills are developed. This class is almost exclusively taught in Chinese. Students will engage in the three language modes: Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "Mandarin Chinese 8, Mandarin Chinese I or departmental approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 48
  },
  {
    "id": "Mandarin Chinese 10 H",
    "dept": "World Languages",
    "code": "575",
    "title": "Mandarin Chinese 10 H",
    "description": "This course seeks to develop more advanced speaking and writing skills in Mandarin. Chinese culture will also be explored. Students will engage in the three language modes: Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. This course will culminate in a comprehensive FLACS exam, which fulfills the NYS Checkpoint B requirement. The proficiency level is Intermediate Low to Mid",
    "credits": 1.0,
    "prerequisite": "Mandarin Chinese 9 Honors or departmental approval",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 48
  },
  {
    "id": "Mandarin Chinese V",
    "dept": "World Languages",
    "code": "0576",
    "title": "Mandarin Chinese V",
    "description": "Language course.",
    "credits": 1.0,
    "prerequisite": "Mandarin Chinese 10, Mandarin Chinese IV or departmental approval.",
    "grade_levels": [],
    "ap_flag": false,
    "level": "Regular",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 48
  },
  {
    "id": "Mandarin Chinese 11 Honors (pre AP)",
    "dept": "World Languages",
    "code": "577",
    "title": "Mandarin Chinese 11 Honors (pre AP)",
    "description": "This checkpoint C level class is a preparation for the Chinese Language and Culture course in grade 12. In this pre-AP class, students will continue to develop their advanced skills in the formal and informal Chinese language. Students will read fiction and nonfiction texts, engage in speaking, writing tasks and continue to develop their listening comprehension skills at an advanced level. Students will engage in the three language modes: Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "Chinese 10 Honors with a grade of 90 or better and a grade of 90 or better on the FLACS Checkpoint B Exam",
    "grade_levels": [
      "11"
    ],
    "ap_flag": false,
    "level": "Honors",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 48
  },
  {
    "id": "AP Mandarin Chinese 12",
    "dept": "World Languages",
    "code": "579",
    "title": "AP Mandarin Chinese 12",
    "description": "This course develops a high level of proficiency in Chinese. Conversational ability is directed toward extended discourse, comprehension of texts on a wide variety of topics, and competent reaction orally and in writing to materials presented for listening and reading. Course content is drawn from broad broad thematic topics. Students will engage in the three language modes : Interpretive in listening and reading, Interpersonal in speaking and writing and Presentational in speaking and writing. In May, those enrolled as AP Mandarin Chinese 12 are expected to take the College Board AP Examination in Chinese. The proficiency level is Intermediate Mid to High",
    "credits": 1.0,
    "prerequisite": "Mandarin Chinese 11 Honors and departmental approval",
    "grade_levels": [
      "12"
    ],
    "ap_flag": true,
    "level": "AP",
    "repeatable": false,
    "additional_notes": "Student Requests Accepted No",
    "source_page": 49
  }
]